{
  "Balloon Cell Cortical Dysplasia": "A brain malformation involving abnormal balloon-like nerve cells.",
  "Carolis Disease": "A rare inherited disorder causing bile duct dilation in the liver.",
  "Congenital Toxoplasmosis": "A parasitic infection passed from mother to fetus causing brain and eye damage.",
  "Dermatomyositis": "An inflammatory disease causing muscle weakness and skin rash.",
  "Gamekeepers Thumb": "A torn ligament in the thumb due to repetitive strain or injury.",
  "Hepatocellular Carcinoma (HCC) and Dysplastic Nodules with Cirrhosis": "A type of liver cancer often found in cirrhotic livers with precancerous nodules.",
  "Japanese B Encephalitis or Epstein-Barr Encephalitis": "Brain inflammation caused by viral infections like Japanese B or Epstein-Barr virus.",
  "Leighs Disease in Spinal Cord and Inferior Colliculi": "A severe neurological disorder affecting the brainstem and spinal cord in children.",
  "Lumbosacral Plexitis": "Nerve inflammation in the lower back causing pain and weakness in the legs.",
  "Moyamoya Disease with Intraventricular Hemorrhage": "A rare brain artery disorder that can lead to bleeding inside the brain’s ventricles.",
  "Myositis Ossificans Progressiva": "A genetic condition where muscles and tissues turn into bone over time.",
  "Neurofibromatosis Type 1 (NF1) with Optic Glioma and Intracranial Extension": "A genetic disorder with nerve tumors, often affecting the eyes and brain.",
  "Optic Glioma": "A slow-growing brain tumor affecting the optic nerve.",
  "Osmotic Demyelination Syndrome": "A brain condition caused by rapid correction of low sodium levels.",
  "Pachygyria with Cerebellar Hypoplasia": "A brain development disorder with thickened brain folds and small cerebellum.",
  "Perisylvian Syndrome": "A brain malformation affecting speech, swallowing, and motor functions.",
  "Plexiform Neurofibroma with Sphenoid Wing Absence": "A nerve tumor growing with skull bone defects, often in NF1.",
  "Rasmussens Encephalitis": "A rare chronic brain inflammation causing seizures and neurological decline.",
  "Retinoblastoma with Intracranial Spread Along Cranial Nerve": "Eye cancer in children that spreads to the brain through nerves.",
  "Right Brachial Plexitis": "Nerve inflammation in the right shoulder causing arm pain and weakness.",
  "Sjögrens Syndrome": "An autoimmune disease that attacks glands producing tears and saliva.",
  "Tuberous Sclerosis": "A genetic disorder causing benign tumors in the brain and other organs.",
  "Typical Adrenoleukodystrophy": "A genetic disease causing damage to the brain's white matter and adrenal glands.",
  "Walker-Warburg Syndrome": "A severe genetic brain and muscle disorder present from birth.",
  "Adenomyosis in Gravid Uterus": "A condition where uterine lining invades the muscle wall during pregnancy.",
  "Bilateral Osgood-Schlatter Disease with Chronic Inflammatory Arthritis": "Knee pain due to growth plate inflammation with arthritis in both legs.",
  "Bilateral Ulnar Impaction Syndrome": "A wrist condition where the ulna bone compresses against the wrist joint on both sides.",
  "Congenital Vaginal Cyst": "A fluid-filled sac in the vaginal area present from birth.",
  "Magnetic Resonance (MR) Spine": "An MRI scan to examine the spinal cord and surrounding structures.",
  "Acute Cerebellitis in HIV": "Sudden inflammation of the cerebellum in a patient with HIV.",
  "Two-Week Follow-Up with Spectroscopy": "An imaging follow-up using spectroscopy to assess metabolic brain changes.",
  "Fukuyama Muscular Dystrophy": "A genetic condition causing muscle weakness and brain abnormalities.",
  "Hallervorden-Spatz Disease (now called Pantothenate Kinase-Associated Neurodegeneration)": "A rare disorder causing iron buildup and damage in the brain.",
  "Low Medial Insertion of Common Bile Duct with Pancreas Divisum-20240916T165825Z-001": "A bile duct anomaly associated with a pancreatic duct malformation.",
  "Magnetic Resonance (MR) Brain": "An MRI scan used to detect abnormalities in the brain.",
  "Acute Unilateral Cerebellitis in HIV": "Inflammation in one side of the cerebellum in an HIV patient.",
    "Pigmented Villonodular Synovitis (PVNS) of Ankle": "This is a benign joint disease with abnormal synovial growth, causing swelling, pain, and bone erosion around the ankle.",
  "Sural Nerve Neurofibroma": "This is a slow-growing, benign nerve tumor that appears as a soft lump along the back of the lower leg.",
  "Thoracic Outlet Syndrome": "This is a condition where nerves or blood vessels are compressed between the neck and shoulder, causing pain, weakness, or swelling.",
  "Walker-Warburg Syndrome": "This is a rare genetic disorder causing severe brain, eye, and muscle abnormalities visible at birth on MRI scans.",
  "Inferior Vena Cava (IVC) Leiomyosarcoma-20240916T165709Z-001": "This is a rare vascular tumor that forms in the inferior vena cava, potentially causing abdominal pain and blood flow obstruction."
}