{
  "acute cerebellitis in hiv|||An MRI image showing diffuse T2 hyperintensity involving both cerebellar hemispheres and the vermis, with preserved gray-white differentiation. The lesions appear ill-defined and non-enhancing, with subtle mass effect on the fourth ventricle, a hallmark of Acute Cerebellitis in HIV.": 0.9976288080215454,
  "acute cerebellitis in hiv|||Axial T2-weighted images reveal symmetric high signal intensity in the cerebellar hemispheres and superior cerebellar peduncles. The lack of associated contrast enhancement or restricted diffusion supports an inflammatory etiology rather than infectious or neoplastic origin.": 0.9976253509521484,
  "acute cerebellitis in hiv|||Coronal views demonstrate patchy cerebellar white matter hyperintensities with sparing of the brainstem and supratentorial structures. The absence of ring enhancement and necrosis distinguishes these findings from cerebellar abscesses or lymphoma.": 0.997629702091217,
  "acute cerebellitis in hiv|||A sagittal image highlights localized cerebellar swelling with displacement of the fourth ventricle, but no supratentorial cortical edema or midline shift. The imaging pattern aligns with non-suppurative cerebellitis in immunocompromised patients.": 0.9976564645767212,
  "acute cerebellitis in hiv|||Multiplanar T2 and FLAIR sequences show bilateral, poorly marginated hyperintensities affecting the cerebellar lobules. The preserved cortical ribbon and lack of hemorrhage or cavitation reinforce a diagnosis of immune-mediated cerebellitis rather than infarction or toxoplasmosis.": 0.997628390789032,
  "acute cerebellitis in hiv|||Lesions predominantly affect the bilateral cerebellar hemispheres and vermis, with secondary involvement of the superior cerebellar peduncles. The brainstem, thalami, and cortical structures are consistently spared, emphasizing the confined posterior fossa distribution.": 0.9976555109024048,
  "acute cerebellitis in hiv|||The imaging demonstrates bilateral, symmetrical cerebellar T2/FLAIR hyperintensities, sparing the cerebral hemispheres and corpus callosum. There is no ventricular enlargement, supporting localized inflammation rather than global encephalopathy or hydrocephalus.": 0.997627854347229,
  "acute cerebellitis in hiv|||The cerebellar lobules and deep white matter show confluent T2 hyperintensity, more pronounced inferiorly. No enhancement, mass effect, or signs of parenchymal breakdown are present, distinguishing this from space-occupying or demyelinating lesions.": 0.9976310729980469,
  "acute cerebellitis in hiv|||Acute Cerebellitis in HIV is classified as an immune-mediated cerebellar inflammatory syndrome. MRI reveals bilateral, non-enhancing cerebellar hyperintensities, helping differentiate it from abscesses, lymphoma, or PML in immunocompromised patients.": 0.9976651668548584,
  "acute cerebellitis in hiv|||This condition falls within the category of post-infectious or immune-triggered cerebellar syndromes. The consistent imaging pattern—symmetric T2 hyperintensities confined to the cerebellum—assists in ruling out opportunistic infections and neoplasms.": 0.997647762298584,
  "acute unilateral cerebellitis in hiv|||An axial FLAIR MRI reveals increased signal intensity within the left cerebellar hemisphere, prominently involving the dentate nucleus and surrounding white matter. There is mild sulcal effacement without central necrosis or ring enhancement, consistent with Acute Unilateral Cerebellitis in HIV. The fourth ventricle is slightly compressed but patent.": 0.997631847858429,
  "acute unilateral cerebellitis in hiv|||Coronal T2-weighted images show focal cerebellar expansion on the left side with hyperintense signal changes and a mass effect on the adjacent vermis. There is no hemorrhage, no diffusion restriction, and no enhancement, suggesting an inflammatory process rather than neoplastic or infectious abscess.": 0.9976238012313843,
  "acute unilateral cerebellitis in hiv|||Axial slices through the posterior fossa demonstrate subtle T2 hyperintensity of the left inferior cerebellar hemisphere, with asymmetric compression of the fourth ventricle. The cerebellar folia are blunted, and there is no involvement of the cerebral hemispheres or midbrain, confirming isolated infratentorial pathology.": 0.9976263046264648,
  "acute unilateral cerebellitis in hiv|||Sagittal images illustrate parenchymal swelling of the left cerebellar hemisphere with preservation of the pons and midbrain structures. No obstructive hydrocephalus is noted, and no T1 hypointensity or blooming artifact is seen, which rules out acute infarction or hemorrhage.": 0.9976412057876587,
  "acute unilateral cerebellitis in hiv|||Axial and sagittal views demonstrate non-enhancing cerebellar hyperintensity without evidence of necrosis, cavitation, or mass lesion. The asymmetry is confined to the cerebellum, sparing the cerebral cortex, basal ganglia, and thalami, which further supports a diagnosis of Acute Unilateral Cerebellitis in HIV.": 0.9976418614387512,
  "acute unilateral cerebellitis in hiv|||Lesions are isolated to the left cerebellar hemisphere, particularly involving the inferior lobe and dentate nucleus, with no involvement of the brainstem or supratentorial regions. The signal abnormality is unilateral, non-necrotic, and non-enhancing, which is key for ruling out opportunistic HIV-related neoplasms.": 0.9976400136947632,
  "acute unilateral cerebellitis in hiv|||MRI reveals asymmetric T2/FLAIR hyperintensity involving the deep cerebellar white matter, causing mild distortion of the fourth ventricle without leading to overt hydrocephalus. The lack of enhancement and restricted diffusion strongly supports cerebellitis over alternative infectious etiologies such as tuberculoma or Listeria rhombencephalitis.": 0.9976238012313843,
  "acute unilateral cerebellitis in hiv|||The cerebral hemispheres, basal ganglia, thalami, and callosal structures are completely spared, confirming this as an infratentorial, focal inflammatory process. The imaging distribution does not favor multifocal processes like PML or HIV encephalitis, which often show bilateral supratentorial involvement.": 0.9976466298103333,
  "acute unilateral cerebellitis in hiv|||This case belongs to the category of immune-mediated post-infectious cerebellitis, with a characteristic imaging profile: unilateral T2/FLAIR hyperintensity, no contrast enhancement, and absence of necrosis. These findings help distinguish it from neoplastic or abscess-forming processes in immunocompromised patients.": 0.9976497292518616,
  "acute unilateral cerebellitis in hiv|||MRI findings are consistent with non-neoplastic, non-opportunistic inflammatory cerebellar pathology, limited to one hemisphere. The lack of mass effect, hemorrhage, or ring enhancement confirms an acute, localized immune response, rather than HIV-associated malignancy or encephalitis.": 0.9976465106010437,
  "adenomyosis in gravid uterus|||An MRI sagittal image reveals a globally enlarged uterus with focal posterior wall thickening. The junctional zone appears disrupted and replaced by multiple T2 hyperintense cystic foci of variable size. The appearance is characteristic of focal adenomyosis, now more pronounced due to gestational uterine expansion.": 0.997657299041748,
  "adenomyosis in gravid uterus|||Coronal and sagittal T2-weighted images demonstrate a heterogeneously hypointense thickened junctional zone with multiple small hyperintense cystic spaces. These lesions exhibit indistinct borders and lack capsular definition, reinforcing the diagnosis of diffuse adenomyosis during pregnancy.": 0.9976509213447571,
  "adenomyosis in gravid uterus|||Axial sequences confirm asymmetrical myometrial thickening more prominent in the posterior fundal wall, with a streaky and patchy appearance of hyperintense foci. No discrete mass or well-circumscribed lesion is identified, ruling out fibroid or gestational trophoblastic disease.": 0.9976618885993958,
  "adenomyosis in gravid uterus|||In mid-sagittal planes, the endometrial stripe is poorly delineated from the adjacent myometrium. The disrupted interface and scattered foci of increased T2 signal are consistent with hormonally active adenomyotic foci within the gravid uterus, lacking the mass effect typical of leiomyomas.": 0.9976763725280762,
  "adenomyosis in gravid uterus|||Multiple planes reveal a speckled or “salt-and-pepper” texture within the myometrium, composed of tiny high-signal foci embedded in low-signal tissue. This mosaic pattern is classic for adenomyosis and appears exaggerated by the gravid state, especially in the posterior uterine wall.": 0.9976708889007568,
  "adenomyosis in gravid uterus|||The adenomyotic involvement is dominantly posterior and fundal in distribution, with asymmetric thickening and multiple cystic foci disrupting the normal junctional zone. The anterior wall remains relatively spared, producing a classic posterior-dominant pattern.": 0.9976739287376404,
  "adenomyosis in gravid uterus|||The pathological process is diffuse rather than nodular, with signal heterogeneity extending from the inner myometrium outward. There is no evidence of serosal breach or contiguous invasion into surrounding pelvic structures, helping exclude malignancy or placenta percreta.": 0.9976807236671448,
  "adenomyosis in gravid uterus|||Imaging suggests that adenomyotic foci are embedded within the inner to mid-myometrial zones, presenting bilaterally but with a clear posterior predominance. The distribution is consistent across multiple planes, with no apparent displacement of surrounding organs.": 0.9976679086685181,
  "adenomyosis in gravid uterus|||Adenomyosis in a gravid uterus remains classified under benign myometrial proliferative disorders. MRI distinguishes it from leiomyomas by the presence of multiple small hyperintense foci, junctional zone thickening, and poor circumscription.": 0.997679591178894,
  "adenomyosis in gravid uterus|||This condition belongs to non-neoplastic uterine pathology and may mimic abnormal placentation or myometrial invasion. Differentiation relies on identifying junctional zone disruption and cystic changes without enhancement or mass effect typical of tumors.": 0.9976758360862732,
  "balloon cell cortical dysplasia|||Axial and coronal FLAIR images show clear cortical thickening and gray-white junction blurring in the right frontal lobe. The involved gyrus appears abnormally broad with poor lamination, and the subcortical white matter demonstrates faint hyperintensity—both classic radiologic markers of FCD Type IIb.": 0.9976466298103333,
  "balloon cell cortical dysplasia|||Multiple slices demonstrate a transmantle sign, a radial hyperintense band extending from the ventricular wall to the cortical surface in the medial frontal region. This vertically oriented pattern is specific to Type IIb FCD and reflects disrupted radial migration pathways associated with balloon cells.": 0.9976578950881958,
  "balloon cell cortical dysplasia|||T1- and T2-weighted images reveal asymmetrical gyral thickening, most evident in the mesial and lateral precentral gyrus, with underlying white matter signal abnormality. The cortical contour remains smooth, and no calcification, cystic change, or post-contrast enhancement is noted.": 0.9976480603218079,
  "balloon cell cortical dysplasia|||FLAIR and coronal T1-weighted images confirm localized cortical dysplasia involving the perirolandic region. There is no associated mass effect, midline shift, or diffusion restriction, strengthening the diagnosis of a stable congenital malformation rather than an active or neoplastic lesion.": 0.9976339340209961,
  "balloon cell cortical dysplasia|||New sagittal views confirm signal changes spanning mesial frontal to anterior cingulate gyrus, with preservation of periventricular white matter. Cortical-subcortical interface abnormalities persist without enhancement or hemorrhagic features, supporting a non-vascular etiology.": 0.9976451992988586,
  "balloon cell cortical dysplasia|||The lesion is sharply demarcated within the right superior frontal and precentral gyri, with radial involvement extending deep to the lateral ventricle. No contralateral or multifocal abnormalities are present. This unilateral focal involvement is consistent with epileptogenic Type IIb FCD.": 0.9976521730422974,
  "balloon cell cortical dysplasia|||Findings consistently show dysplastic changes in the medial frontal and anterior cingulate cortices, with sparing of basal ganglia, thalami, and infratentorial structures. The lesion shows vertical orientation and subcortical signal extension, forming the classic transmantle trajectory.": 0.9976511001586914,
  "balloon cell cortical dysplasia|||The pathology remains supratentorial, asymmetric, and localized to one hemisphere. Cortical thickening and signal alteration are evident in sensorimotor regions, a frequent site of seizure onset in pediatric FCD Type IIb cases. There is no evidence of bilateral synchrony or multilobar extension.": 0.9976491332054138,
  "balloon cell cortical dysplasia|||Balloon Cell Cortical Dysplasia is a subtype of Focal Cortical Dysplasia Type IIb, a non-neoplastic, congenital cortical malformation. It frequently underlies refractory focal epilepsy and is identified by radial migration disturbance and characteristic imaging markers such as the transmantle sign.": 0.9976973533630371,
  "balloon cell cortical dysplasia|||Differentiating features from gliomas, encephalitis, or tuberous sclerosis include absence of enhancement, stable signal characteristics, and radial band-like signal extension without edema. These combined findings confirm the diagnosis of FCD Type IIb over mimickers with overlapping imaging profiles.": 0.997647225856781,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||An MRI image showing bilateral tibial tuberosity fragmentation with adjacent marrow hyperintensity on fat-suppressed T2-weighted sagittal views. Patellar tendon thickening and mild prepatellar soft tissue edema are noted, consistent with traction apophysitis and chronic inflammatory changes in Bilateral Osgood-Schlatter Disease with inflammatory arthritis.": 0.9976638555526733,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||A coronal T2-weighted image shows symmetric high-signal intensity in the tibial apophyseal region with cortical irregularity and anterior soft tissue swelling. No large joint effusion is visible, but subtle synovial thickening is present, suggestive of concurrent low-grade chronic arthritis.": 0.9976469874382019,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||A sagittal image demonstrates thickened distal patellar tendon with focal edema at its insertion on the tibial tuberosity, along with irregular ossification patterns bilaterally. These findings support chronic repetitive traction injury exacerbated by inflammatory arthropathy.": 0.9976786971092224,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||MRI reveals moderate soft tissue hyperintensity surrounding both anterior tibial tuberosities, associated with hypointense linear clefts representing apophyseal fragmentation. Joint space appears preserved; however, there is peripheral synovial enhancement suggestive of chronic inflammatory involvement.": 0.9976450800895691,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||Axial and sagittal sequences reveal bilateral peri-tibial soft tissue edema and increased signal within the distal quadriceps and patellar tendons. Subtle subchondral marrow changes in the proximal tibia bilaterally are evident, supporting a mixed mechanical-inflammatory etiology consistent with the chronic disease spectrum.": 0.9976528882980347,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||Lesions are bilaterally localized to the anterior proximal tibia at the tibial tuberosity, with consistent fragmentation and reactive marrow changes. The distribution is symmetric, extra-articular, and peri-tendinous, focused at the patellar tendon insertion, without intra-articular cartilage or meniscal involvement.": 0.9976761937141418,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||The disease pattern involves the apophyseal region of both tibial tuberosities, showing irregular ossification centers and marrow edema. Chronic inflammatory changes extend into the prepatellar and infrapatellar soft tissues. There is no posterior compartment, cruciate ligament, or meniscal extension.": 0.9976663589477539,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||MRI findings highlight a confined anatomical footprint—primarily anterior and extra-articular—without effusion or cartilage erosion. Bilateral signal abnormalities and periosteal reaction remain restricted to tendon-bone interface zones, excluding any involvement of neurovascular or intracapsular knee structures.": 0.997649610042572,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||This condition is classified under traction apophysitis with secondary rheumatologic overlap. MRI findings correspond to a chronic inflammatory musculoskeletal condition, not to neurodegenerative, demyelinating, or neoplastic CNS disorders.": 0.9976645708084106,
  "bilateral osgood-schlatter disease with chronic inflammatory arthritis|||Bilateral Osgood-Schlatter Disease with Chronic Inflammatory Arthritis is a pediatric mechanical-inflammatory disorder affecting the tibial apophyses. It belongs to the spectrum of orthopedic and juvenile inflammatory pathologies, with no neuroimaging indication for brain or spinal involvement.": 0.9977215528488159,
  "bilateral ulnar impaction syndrome|||An MRI image displaying positive ulnar variance bilaterally, with distal ulna extending beyond the ulnar corner of the radius, contributing to increased mechanical loading on the lunate and triquetrum—hallmarks of Bilateral Ulnar Impaction Syndrome.": 0.9976798295974731,
  "bilateral ulnar impaction syndrome|||A high-resolution coronal MRI slice reveals irregular thinning of the articular cartilage at the ulnolunate and ulnotriquetral joints, accompanied by subchondral bone signal alterations, consistent with chronic ulnocarpal impaction.": 0.9976628422737122,
  "bilateral ulnar impaction syndrome|||Axial T2-weighted MRI demonstrates hyperintense signal in the soft tissues surrounding the triangular fibrocartilage complex (TFCC), with fraying of its borders and mild fluid collection suggestive of chronic degenerative stress injury.": 0.9976631999015808,
  "bilateral ulnar impaction syndrome|||An MRI image shows bilateral cortical remodeling of the lunate and triquetrum with underlying bone marrow hyperintensity and subtle cystic changes—findings supportive of repetitive impaction stress in Bilateral Ulnar Impaction Syndrome.": 0.9976678490638733,
  "bilateral ulnar impaction syndrome|||Sagittal plane imaging reveals flattening of the lunate's proximal surface with adjacent joint effusion and early osteoarthritic changes along the ulnocarpal articulation, consistent with bilateral mechanical abutment due to ulnar impaction.": 0.997688889503479,
  "bilateral ulnar impaction syndrome|||The syndrome shows a symmetric bilateral distribution, primarily involving the ulnolunate and ulnotriquetral joints, with secondary degenerative changes in the TFCC and reactive bone marrow edema in adjacent carpal bones.": 0.997664749622345,
  "bilateral ulnar impaction syndrome|||MRI confirms the involvement of both distal radioulnar joints and proximal carpal rows. Positive ulnar variance correlates with cartilage wear, bone marrow edema, and TFCC degeneration across both wrists.": 0.9976843595504761,
  "bilateral ulnar impaction syndrome|||There is no evidence of contrast enhancement, mass effect, or diffusion restriction, reaffirming the chronic, mechanical, non-inflammatory etiology. Imaging shows consistent bilateral signal abnormalities localized to the ulnar-sided wrist structures.": 0.9976645708084106,
  "bilateral ulnar impaction syndrome|||Bilateral Ulnar Impaction Syndrome is classified as a chronic degenerative ulnocarpal overuse condition. It is non-neurological and falls under orthopedic pathology affecting the wrist, with hallmark MRI features aiding in its differentiation from TFCC tears and inflammatory arthritides.": 0.9976891279220581,
  "bilateral ulnar impaction syndrome|||This entity is not a central nervous system disorder and is unrelated to demyelination or neoplasia. It represents a mechanical, musculoskeletal classification with distinct imaging features of positive ulnar variance and ulnocarpal overload.": 0.9976889491081238,
  "carolis disease|||A coronal T2-weighted MRI shows numerous hyperintense cystic structures radiating outward from the porta hepatis. These tubular dilations are consistent with intrahepatic bile duct ectasia and display classic central dot signs, diagnostic of Caroli’s Disease.": 0.9976712465286255,
  "carolis disease|||Axial MR images demonstrate multifocal ductal ectasia forming a beaded pattern along the hepatic parenchyma. The dilated ducts are fluid-filled, non-septated, and demonstrate no associated wall thickening or periductal inflammation.": 0.9976717233657837,
  "carolis disease|||Sagittal images show elongated high-signal channels following the intrahepatic biliary tract. There is continuity with the main biliary system and no evidence of biliary obstruction, sludge, or stones, ruling out secondary cholangiectasis.": 0.9976844787597656,
  "carolis disease|||New MRCP-style sequences capture a diffuse string of pearls appearance throughout the right hepatic lobe. These cystic ductal dilations are non-enhancing and remain intrahepatic, without extension into the extrahepatic ducts or gallbladder.": 0.9977109432220459,
  "carolis disease|||Axial sequences reveal ductal dilations with fluid-fluid layering, suggesting chronic bile stasis. The ductal margins remain thin and regular. No enhancing soft tissue or nodularity is present, excluding cholangiocarcinoma or biliary cystadenoma.": 0.997679591178894,
  "carolis disease|||The disease shows dominant involvement of segments V–VIII, with focal extension into segment IV. All findings are confined to the intrahepatic ducts, with the extrahepatic bile ducts appearing normal and non-dilated.": 0.9976872801780701,
  "carolis disease|||Distribution is multifocal and asymmetric, with bilateral involvement but greater dilatation in the right hepatic lobe. There is no associated atrophy or compensatory hypertrophy of hepatic parenchyma.": 0.9977020621299744,
  "carolis disease|||Despite widespread ductal dilatation, no associated signs of hepatic fibrosis, splenomegaly, or portal hypertension are present, ruling out Caroli Syndrome. The disease remains a non-fibrotic, isolated intrahepatic malformation.": 0.9977428317070007,
  "carolis disease|||Caroli’s Disease is a congenital ductal plate anomaly limited to intrahepatic bile ducts. It is a subtype of fibropolycystic liver disease, characterized by non-obstructive ductal ectasia with preserved hepatocellular architecture.": 0.9977378845214844,
  "carolis disease|||Differential diagnoses include recurrent pyogenic cholangitis, polycystic liver disease, and sclerosing cholangitis. The absence of biliary strictures, hepatic fibrosis, and cystic kidney involvement supports isolated Caroli’s Disease.": 0.9977301955223083,
  "congenital toxoplasmosis|||Axial T2-weighted images show bilateral, symmetric periventricular calcifications and adjacent white matter hyperintensities, producing characteristic signal voids on susceptibility-weighted sequences. These findings confirm chronic parenchymal damage typical of Congenital Toxoplasmosis.": 0.997650146484375,
  "congenital toxoplasmosis|||Coronal MRI reveals frontal and parietal cortical thinning with marked sulcal widening. The pattern of diffuse cortical atrophy, paired with ventriculomegaly and delayed myelination, aligns with long-term sequelae of congenital CNS infection.": 0.9976446032524109,
  "congenital toxoplasmosis|||A sagittal view highlights thinning and elevation of the corpus callosum and underdeveloped myelination in the centrum semiovale. The high signal in deep white matter tracts reflects immature or damaged fibers in the context of prenatal injury.": 0.9976525902748108,
  "congenital toxoplasmosis|||T2-weighted images depict asymmetric hyperintensities in the thalami and brainstem tegmentum, without mass effect or enhancement. These lesions likely represent gliotic scars from prior necrotizing encephalitis during fetal development.": 0.9976376295089722,
  "congenital toxoplasmosis|||In multiple coronal slices, ventriculomegaly with no transependymal CSF flow is evident, ruling out obstructive hydrocephalus. Instead, it suggests volume loss from cerebral atrophy—an imaging pattern consistent with congenital toxoplasmic encephalopathy.": 0.9976511001586914,
  "congenital toxoplasmosis|||Involvement is most prominent in periventricular white matter, deep gray nuclei, and posterior internal capsule, all affected bilaterally. The preservation of the cerebellum and lack of migrational defects help differentiate from other TORCH infections.": 0.9976550936698914,
  "congenital toxoplasmosis|||Calcifications are consistently found in the basal ganglia, periventricular rim, and cortical-subcortical junctions, appearing hypointense on T2 and blooming on GRE/SWI. These calcific densities support a prenatal rather than postnatal infectious process.": 0.9976412653923035,
  "congenital toxoplasmosis|||White matter abnormalities extend across frontal and occipital lobes, with associated callosal dysgenesis. Combined with the imaging evidence of delayed myelination, these changes underscore disrupted neurodevelopment during early gestation.": 0.9976826310157776,
  "congenital toxoplasmosis|||Congenital Toxoplasmosis is a TORCH-associated neuroinflammatory disorder, primarily affecting fetal CNS tissue. MRI shows a triad of calcifications, white matter damage, and ventriculomegaly, crucial for early diagnosis and prognosis.": 0.9976813197135925,
  "congenital toxoplasmosis|||Imaging features—especially deep gray matter calcifications, diffuse atrophy, and preserved cortical lamination—help distinguish toxoplasmosis from CMV (which shows subependymal cysts) and Zika (which causes cortical migrational abnormalities).": 0.9976646304130554,
  "congenital vaginal cyst|||An MRI image shows a well-circumscribed, unilocular T2-hyperintense cyst situated posterior to the vaginal canal, displacing adjacent tissues without infiltration. The cyst wall remains thin, with no enhancement or nodularity—findings consistent with a benign congenital vaginal cyst.": 0.9976570010185242,
  "congenital vaginal cyst|||Sagittal T2-weighted MRI demonstrates a fluid-filled lesion with high signal intensity and regular margins in the posterior vaginal wall. The cyst exerts anterior mass effect on the vaginal lumen but maintains clear boundaries from the rectum and bladder, ruling out invasive pathology.": 0.9976548552513123,
  "congenital vaginal cyst|||Axial sections reveal a hyperintense, oval lesion with uniform signal, compressing adjacent soft tissues slightly but with no irregular septations or internal debris. The lesion is confined to the distal vaginal region, consistent with a Müllerian remnant cyst rather than a neoplastic mass.": 0.9976493120193481,
  "congenital vaginal cyst|||A transverse pelvic image illustrates a solitary cystic structure with smooth internal fluid and no air-fluid level or hemorrhagic content. Its stable signal intensity across slices and lack of diffusion restriction support a diagnosis of a simple congenital vaginal cyst.": 0.99767005443573,
  "congenital vaginal cyst|||Coronal and sagittal images consistently show a homogenous, non-enhancing cyst centered along the mid-to-lower posterior vaginal wall. There is no apparent pelvic lymphadenopathy or extension into paravaginal structures, reinforcing its benign, isolated character.": 0.9976596832275391,
  "congenital vaginal cyst|||The cyst is localized to the posterior or posterolateral aspect of the distal vaginal canal, most commonly along the midline, without extension into the pelvic musculature, rectovaginal septum, or uterine structures. The lesion appears solitary and clearly encapsulated.": 0.9976891279220581,
  "congenital vaginal cyst|||Anatomically, the lesion is limited to the lower third of the vaginal canal and demonstrates no continuity with the spinal canal, neural foramina, or sacral defects. The absence of any tethered cord or meningocele further confirms its non-neurogenic origin.": 0.9976775050163269,
  "congenital vaginal cyst|||The pattern of involvement remains unifocal and asymmetric in some cases, with mild anterior displacement of the vagina and adjacent pelvic organs. There is no evidence of bilateral lesions, perineural extension, or involvement of adnexal or uterine structures.": 0.997665524482727,
  "congenital vaginal cyst|||Congenital Vaginal Cyst is classified under benign developmental Müllerian duct anomalies. It is distinctly non-neoplastic, with MRI playing a central role in excluding mimics such as rectovaginal fistula, Bartholin cyst, or pelvic neurogenic tumors.": 0.9977132081985474,
  "congenital vaginal cyst|||This lesion falls under the category of non-neurogenic congenital cystic pelvic anomalies. Imaging confirms a lack of communication with the spinal axis, helping differentiate it from Tarlov cysts, presacral meningoceles, or anterior sacral meningocele.": 0.9976625442504883,
  "dermatomyositis|||Axial STIR images demonstrate diffuse, symmetric hyperintensity in the anterior and posterior thigh compartments, with edema spanning the vastus medialis, adductor magnus, and biceps femoris. The muscles remain preserved in bulk, consistent with active, non-atrophic inflammatory myopathy such as Dermatomyositis.": 0.9976471662521362,
  "dermatomyositis|||Coronal imaging reveals linear, sheet-like hyperintense signal along the deep fascia and interfascial planes, particularly in the gluteal and posterior pelvic regions. This pattern is highly specific to Dermatomyositis, as polymyositis lacks such extensive fascial involvement.": 0.9976440072059631,
  "dermatomyositis|||Multiple axial sequences show T2/STIR hyperintensity within the subcutaneous tissues, especially overlying the lateral thigh and pelvis. The pattern of perifascial and subdermal edema correlates with cutaneous inflammation often present in Dermatomyositis.": 0.9976460337638855,
  "dermatomyositis|||A distinct absence of fatty infiltration or rim enhancement is observed in affected muscle groups. The muscles appear edematous but maintain their architecture, distinguishing this condition from chronic myopathies or abscess-forming infectious etiologies.": 0.9976681470870972,
  "dermatomyositis|||T2-weighted axial images of the shoulder girdle highlight signal elevation in the deltoid, supraspinatus, and infraspinatus muscles, without evidence of tendon rupture or tear. This supports an inflammatory myopathic process rather than rotator cuff pathology.": 0.9976640939712524,
  "dermatomyositis|||Dermatomyositis classically presents with symmetric, proximal muscle involvement, including the gluteals, quadriceps, deltoids, and pelvic girdle musculature. The disease spares distal musculature and joints, aiding its radiologic distinction from inclusion body myositis.": 0.9977004528045654,
  "dermatomyositis|||Perifascial edema is prominent in subcutaneous planes and deep fascial envelopes, especially around the tensor fascia lata and gluteal aponeuroses. This distribution is rare in other myopathies and is a key diagnostic marker in imaging for Dermatomyositis.": 0.9976925849914551,
  "dermatomyositis|||Subcutaneous tissue involvement is most pronounced in lateral thigh and pelvic regions. Fascial thickening and fluid signal tracking without associated abscess formation help exclude necrotizing infections and favor an autoimmune inflammatory cause.": 0.9976532459259033,
  "dermatomyositis|||Dermatomyositis is an autoimmune connective tissue disease categorized under idiopathic inflammatory myopathies. MRI helps evaluate disease extent, monitor therapy, and guide biopsy by identifying fascial and intramuscular edema without chronic degeneration.": 0.9976970553398132,
  "dermatomyositis|||MRI findings of fascial edema, symmetric proximal muscle involvement, and preserved architecture distinguish Dermatomyositis from polymyositis and muscular dystrophies. It also helps rule out abscesses, tumors, and denervation syndromes in equivocal clinical presentations.": 0.9976522326469421,
  "fukuyama muscular dystrophy|||An axial MRI reveals diffuse cortical malformations with a polymicrogyria-like pattern, most prominent in the frontal and parietal lobes. There is irregularity of the cortical ribbon and shallow sulci bilaterally, reflecting abnormal neuronal migration. These findings are consistent with the cortical dysplasia seen in Fukuyama Muscular Dystrophy.": 0.9976531863212585,
  "fukuyama muscular dystrophy|||Coronal T2-weighted images demonstrate moderate cerebellar hypoplasia, primarily affecting the vermis, along with inferior vermian flattening and enlargement of the fourth ventricle. This infratentorial involvement is a hallmark finding in dystroglycanopathies like FMD.": 0.9976261258125305,
  "fukuyama muscular dystrophy|||Axial and sagittal sections show white matter signal hyperintensity on T2/FLAIR, with a symmetric periventricular and subcortical distribution, especially in the posterior centrum semiovale and corona radiata, without mass effect or diffusion restriction—consistent with delayed or disordered myelination.": 0.9976257085800171,
  "fukuyama muscular dystrophy|||Midline sagittal imaging reveals a relatively thin corpus callosum and dilated lateral ventricles, indicative of mild ventriculomegaly. These findings suggest impaired cerebral development, further supporting the congenital nature of Fukuyama Muscular Dystrophy.": 0.9976567029953003,
  "fukuyama muscular dystrophy|||No evidence of contrast enhancement, ring lesions, or diffusion restriction is seen throughout the brain parenchyma. The absence of acute inflammatory or neoplastic features confirms that the pathology is developmental rather than acquired or progressive.": 0.9976583123207092,
  "fukuyama muscular dystrophy|||Cortical malformations in FMD predominantly affect the frontal and parietal lobes, with bilateral polymicrogyria-like changes, including cortical thickening and abnormal gyral organization. These patterns suggest a global but non-focal disturbance in neuronal migration, distinguishing FMD from focal cortical dysplasia.": 0.9976804256439209,
  "fukuyama muscular dystrophy|||White matter abnormalities are extensive and symmetrically distributed, involving periventricular, subcortical, and deep hemispheric regions. T2/FLAIR hyperintensity without diffusion restriction or enhancement confirms non-progressive dysmyelination, not consistent with leukodystrophies or metabolic white matter disorders.": 0.9976380467414856,
  "fukuyama muscular dystrophy|||Posterior fossa imaging shows moderate cerebellar vermis hypoplasia and inferior cerebellar volume loss, with no mass effect. Brainstem morphology is relatively preserved. These infratentorial findings support the classification of FMD within the congenital muscular dystrophies with brain involvement.": 0.997654378414154,
  "fukuyama muscular dystrophy|||Fukuyama Muscular Dystrophy is a congenital alpha-dystroglycanopathy marked by cortical dysplasia, cerebellar hypoplasia, and delayed myelination. Its imaging profile helps differentiate it from primary leukodystrophies, metabolic encephalopathies, and acquired demyelinating disease.": 0.9976953268051147,
  "fukuyama muscular dystrophy|||FMD belongs to the group of structural neurodevelopmental disorders associated with muscular dystrophies. MRI reveals characteristic bilateral malformations and cerebellar underdevelopment, setting it apart from purely degenerative or inflammatory central nervous system conditions.": 0.9976913332939148,
  "gamekeepers thumb|||An MRI image showing full-thickness tear of the ulnar collateral ligament (UCL) at the base of the proximal phalanx, with proximal retraction and interposed hypointense fibers of the adductor aponeurosis, characteristic of a Stener lesion, consistent with Gamekeeper’s Thumb.": 0.9976802468299866,
  "gamekeepers thumb|||Coronal T2-weighted sequence reveals marked soft tissue edema and fluid-sensitive hyperintensity at the ulnar aspect of the first metacarpophalangeal joint. There is clear disruption of ligament fibers without bony avulsion, confirming a ligamentous failure pattern typical of this condition.": 0.997657060623169,
  "gamekeepers thumb|||Axial images demonstrate thickened, heterogeneous UCL remnants surrounded by increased signal in periligamentous fat. The absence of normal fibrillar ligament continuity and surrounding capsular distension support acute-phase Gamekeeper’s Thumb.": 0.9976845383644104,
  "gamekeepers thumb|||Sagittal slice shows edematous changes within the adductor pollicis muscle belly, adjacent to a disrupted UCL footprint. These findings reflect secondary muscle strain from chronic valgus instability, confirming progression in longstanding cases.": 0.9976806044578552,
  "gamekeepers thumb|||Oblique MRI view displays elongated and indistinct UCL fibers, without signs of scarring or reattachment. Subtle fluid signal clefts extend into the joint capsule, excluding partial sprain and pointing to chronic, untreated Gamekeeper’s Thumb.": 0.997666597366333,
  "gamekeepers thumb|||Injury is consistently confined to the ulnar aspect of the first MCP joint, with involvement of the distal UCL attachment and adjacent capsular insertion. Imaging shows localized edema and fiber discontinuity with no extension to radial or volar structures.": 0.9977047443389893,
  "gamekeepers thumb|||Lesions show a unilateral distribution, involving the proximal phalanx base and adductor aponeurosis, with occasional extension into the volar plate. No evidence of bony avulsion or carpometacarpal ligament involvement is present, refining the diagnosis to soft-tissue injury.": 0.9976851940155029,
  "gamekeepers thumb|||Findings are focused on the medial ligament complex of the thumb MCP joint, sparing the flexor pollicis longus and extensor pollicis longus tendons. These spatial features distinguish the lesion from flexor pulley injuries or tenosynovitis.": 0.997718334197998,
  "gamekeepers thumb|||Gamekeeper’s Thumb is a ligamentous injury classified under traumatic musculoskeletal disorders. MRI allows precise visualization of UCL disruption, especially when a Stener lesion complicates spontaneous healing and necessitates surgical repair.": 0.9977307915687561,
  "gamekeepers thumb|||This is a subtype of ligamentous hand trauma with characteristic UCL tearing at the MCP joint. MRI distinguishes it from degenerative MCP instability or sesamoid displacement through identification of ligament discontinuity, retraction, and soft tissue interposition.": 0.9976927042007446,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||An axial T2-weighted MRI demonstrates bilateral hypointense signals in the medial globus pallidus with a faint central hyperintense core, producing a subtle but discernible 'eye of the tiger' appearance, consistent with Pantothenate Kinase-Associated Neurodegeneration in its typical radiologic phase.": 0.9976712465286255,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||Coronal and axial sequences reveal patchy hypointensity in the globus pallidus bilaterally with surrounding subtle hyperintensity. The iron deposition pattern is symmetric and well-contained, reinforcing the hallmark imaging sign associated with PKAN.": 0.9976715445518494,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||On SWI-like sequences, there is pronounced susceptibility artifact in the globus pallidus and substantia nigra, more prominent on the right, consistent with iron accumulation. No associated mass effect or edema is noted, supporting a neurodegenerative etiology.": 0.997672438621521,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||T1-weighted sequences show no enhancing lesions or cortical abnormalities. However, deep gray matter structures show markedly reduced signal intensity, especially in the basal ganglia, a feature correlating with paramagnetic substance deposition in PKAN.": 0.997656524181366,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||Diffusion-weighted imaging and T1 post-contrast series reveal no signs of acute ischemia or abnormal enhancement, helping exclude inflammatory or neoplastic processes. The persistent low signal in deep nuclei supports a chronic iron storage disorder like PKAN.": 0.9976627230644226,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||The disease predominantly affects the medial globus pallidus bilaterally, with consistent signal abnormalities on T2 and SWI. Subtle involvement of the substantia nigra is also visible, though without thalamic or putaminal extension, refining its localization pattern.": 0.9976633787155151,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||Iron deposition is sharply localized to the globus pallidus internus, sparing cortical and subcortical white matter, thalami, and cerebellum. This spatial restriction helps narrow differential diagnosis within NBIA syndromes.": 0.997680127620697,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||No evidence of cerebral or cerebellar atrophy is detected in this dataset. The anatomical changes remain confined to bilateral basal ganglia with no involvement of ventricular size or periventricular white matter, reinforcing a localized neurodegenerative process.": 0.9976582527160645,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||PKAN is a genetically driven neurodegenerative disorder within the NBIA group, marked by bilateral iron deposition in the globus pallidus. Imaging shows progressive T2/SWI hypointensity without contrast enhancement, excluding tumors or infections.": 0.9976792931556702,
  "hallervorden-spatz disease (now called pantothenate kinase-associated neurodegeneration)|||Classified under neurodegeneration with brain iron accumulation, PKAN demonstrates characteristic basal ganglia signal changes. Differential diagnosis includes Wilson disease and neuroferritinopathy, but absence of hepatic signs and cortical involvement favors PKAN.": 0.9976766109466553,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||An MRI image showing a large, irregular hyperintense mass in the right hepatic lobe with peripheral rim enhancement and central necrosis, consistent with Hepatocellular Carcinoma (HCC) and Dysplastic Nodules with Cirrhosis.": 0.9976698160171509,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||An MRI image showing nodular contouring of the liver with multiple small T2 hyperintense nodules diffusely distributed, reflecting a cirrhotic background with associated dysplastic changes, consistent with HCC and Dysplastic Nodules.": 0.997678279876709,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||An MRI image showing heterogeneous enhancement of a dominant lesion during arterial phase with subsequent washout in the delayed phase, a hallmark finding in Hepatocellular Carcinoma.": 0.9976858496665955,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||An MRI image showing distortion of intrahepatic vasculature with mass effect on adjacent segments, associated with capsular retraction, consistent with advanced Hepatocellular Carcinoma and underlying cirrhosis.": 0.9976804256439209,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||An MRI image showing a cirrhotic liver architecture with coarse parenchymal texture and scattered hypointense nodules lacking contrast uptake, likely representing non-enhancing dysplastic nodules.": 0.9976903200149536,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||Lesions primarily involve the right hepatic lobe, with multifocal distribution seen along the periphery of segment VII and VIII. Nodules appear with arterial enhancement and delayed washout, characteristic of HCC.": 0.9976706504821777,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||The imaging reveals a shrunken liver with a nodular surface and irregular parenchymal enhancement, most prominent in the posterior segments of the right lobe. These findings are typical in cirrhotic livers with dysplastic nodule formation.": 0.9976713061332703,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||Nodular lesions appear asymmetrically, often favoring the right hepatic lobe but may be present in both lobes. Vascular encasement and portal vein narrowing are seen in advanced stages, aiding in staging and differential diagnosis.": 0.9976872205734253,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||Hepatocellular Carcinoma with underlying cirrhosis is classified as a primary hepatic malignancy, often arising in the context of chronic liver disease. Imaging differentiation from regenerative or dysplastic nodules is critical for staging and management.": 0.9977112412452698,
  "hepatocellular carcinoma (hcc) and dysplastic nodules with cirrhosis|||This disease falls under the category of hepatic tumors. Dysplastic nodules represent pre-malignant lesions within a cirrhotic liver, and MRI helps distinguish them from early HCC using enhancement patterns and diffusion characteristics.": 0.9976831078529358,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||An axial T2-weighted MRI demonstrates a large, heterogeneously hyperintense mass along the retroperitoneal course of the IVC. The lesion is eccentrically positioned with areas of central necrosis and marginal pseudocapsule, displacing adjacent bowel loops and vessels, consistent with IVC leiomyosarcoma.": 0.9976621270179749,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||Coronal imaging reveals a lobulated retrocaval soft tissue mass extending superiorly and inferiorly along the IVC axis. It exhibits mixed signal intensity with irregular borders and asymmetric compression of adjacent structures, suggesting aggressive mural origin rather than thrombus.": 0.9976597428321838,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||Multiple slices show evidence of an intravascular soft tissue component expanding the IVC lumen. This is seen as a mass with intermediate T2 signal and peripheral enhancement, consistent with an intraluminal, wall-originating leiomyosarcoma rather than bland thrombus or vascular invasion from renal malignancy.": 0.9976872205734253,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||A sagittal MRI view highlights the longitudinal extent of the mass, following the IVC course caudally to the iliac confluence. The tumor displays infiltrative features and causes distortion of the IVC contour while maintaining partial luminal patency—a hallmark of early-stage IVC leiomyosarcoma.": 0.997679591178894,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||Axial abdominal images show the tumor displacing adjacent organs without frank invasion. The margins are irregular but non-spiculated, with visible peritumoral edema. No calcifications are seen. These characteristics support a diagnosis of leiomyosarcoma over retroperitoneal fibrosis or lymphoma.": 0.9976725578308105,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||The tumor originates from the infrarenal and infrahepatic segments of the IVC and extends bidirectionally. The distribution is vertically elongated and eccentric, localized to the right-sided retroperitoneal space with medial mass effect on the aorta and bowel displacement.": 0.9976929426193237,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||New images reveal tumor encroachment into the lower thoracic field, suggesting cranial progression. However, no cardiac or hepatic venous involvement is observed. The mass demonstrates a unilateral retrocaval distribution with partial luminal occlusion and extraluminal expansion.": 0.9976727962493896,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||The tumor spares the suprarenal IVC and hepatic veins, but encases the IVC wall and extends posteriorly near the vertebral bodies. This asymmetric pattern favors a primary vascular neoplasm over retroperitoneal sarcoma, which typically grows anterior to vascular structures.": 0.9976873993873596,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||IVC leiomyosarcoma is a rare malignant soft tissue sarcoma of vascular smooth muscle origin. It is classified under non-visceral soft tissue tumors and may mimic thrombus or metastasis on imaging without enhancement patterns and mural continuity.": 0.9977098703384399,
  "inferior vena cava (ivc) leiomyosarcoma-20240916t165709z-001|||In MRI-based differential diagnosis, distinguishing features include eccentric origin from the IVC wall, lobulated morphology, and heterogeneous signal intensity. These help differentiate it from renal cell carcinoma with venous invasion or bland IVC thrombus.": 0.9976590871810913,
  "japanese b encephalitis or epstein-barr encephalitis|||An MRI image reveals bilateral thalamic T2/FLAIR hyperintensities with a sharper medial focus and subtle surrounding edema, with no hemorrhage or enhancement, consistent with Japanese B Encephalitis.": 0.9976522922515869,
  "japanese b encephalitis or epstein-barr encephalitis|||New DWI images demonstrate patchy diffusion restriction in the periventricular and parietal subcortical white matter, especially on the left, suggesting cytotoxic edema typical of Epstein-Barr Encephalitis.": 0.997664213180542,
  "japanese b encephalitis or epstein-barr encephalitis|||Axial sequences reveal cerebellar hyperintensities in the dentate nuclei and superior cerebellar peduncles, bilaterally, consistent with posterior fossa involvement in Japanese B Encephalitis.": 0.9976622462272644,
  "japanese b encephalitis or epstein-barr encephalitis|||SWI sequences show no evidence of microhemorrhage, allowing exclusion of hemorrhagic transformation and helping differentiate from viral hemorrhagic encephalitides.": 0.9976987242698669,
  "japanese b encephalitis or epstein-barr encephalitis|||Multiple FLAIR slices demonstrate scattered punctate hyperintensities in the centrum semiovale and corona radiata, consistent with perivascular inflammation in a subacute encephalitic stage.": 0.9976732134819031,
  "japanese b encephalitis or epstein-barr encephalitis|||MRI reveals bilateral thalamic and basal ganglia involvement with symmetric T2/FLAIR hyperintensities, characteristic of Japanese B Encephalitis and aiding its distinction from HSV.": 0.9976426959037781,
  "japanese b encephalitis or epstein-barr encephalitis|||Asymmetric involvement of parietal and periventricular white matter, with diffusion restriction and no hemorrhage, favors Epstein-Barr Encephalitis.": 0.9976865649223328,
  "japanese b encephalitis or epstein-barr encephalitis|||Involvement of cerebellar hemispheres and midbrain tegmentum supports posterior fossa tropism in Japanese B Encephalitis when combined with supratentorial deep gray matter injury.": 0.9976979494094849,
  "japanese b encephalitis or epstein-barr encephalitis|||Japanese B Encephalitis is a flaviviral meningoencephalitis with deep gray matter and posterior fossa predilection, confirmed by bilateral thalamic and cerebellar injury without hemorrhage.": 0.9976982474327087,
  "japanese b encephalitis or epstein-barr encephalitis|||Epstein-Barr Encephalitis is a herpesvirus-associated CNS infection showing asymmetric cortical and periventricular involvement with diffusion restriction and no hemorrhagic features.": 0.9976760745048523,
  "leighs disease in spinal cord and inferior colliculi|||An MRI image shows bilateral T2 hyperintensities within the inferior colliculi and dorsal midbrain, with signal continuity along the periaqueductal gray. No hemorrhagic foci or contrast enhancement is observed, consistent with Leigh’s Disease.": 0.997642993927002,
  "leighs disease in spinal cord and inferior colliculi|||Axial cervical spine images reveal a central 'snake-eye' appearance in the anterior horns, with symmetrical T2 hyperintensity confined to the gray matter. This pattern aligns with known spinal cord manifestations of Leigh’s Disease.": 0.9976658821105957,
  "leighs disease in spinal cord and inferior colliculi|||Sagittal T2-weighted images show multifocal high signal in the upper cervical and thoracic cord, with greatest intensity in the central gray matter and minimal cord expansion. These features are consistent with subacute Leigh's Disease involvement.": 0.9976327419281006,
  "leighs disease in spinal cord and inferior colliculi|||Axial brain MRI reveals hyperintensity within the putamen and caudate heads, bilaterally and symmetrically. These extrapyramidal changes reinforce the diagnosis of systemic mitochondrial encephalopathy such as Leigh’s Disease.": 0.9976468086242676,
  "leighs disease in spinal cord and inferior colliculi|||New sagittal sequences demonstrate T2 hyperintensities in the dorsal medulla and pontomedullary junction, extending to the midbrain. The lesions spare the corticospinal tracts and are not associated with diffusion restriction, supporting a metabolic origin.": 0.9976381659507751,
  "leighs disease in spinal cord and inferior colliculi|||The disease shows symmetric bilateral involvement of the inferior colliculi, dorsal midbrain, and periaqueductal gray, often accompanied by changes in the basal ganglia. This topography reflects a mitochondrial pattern of neurodegeneration.": 0.9976620674133301,
  "leighs disease in spinal cord and inferior colliculi|||Spinal MRI reveals longitudinally extensive, centrally located T2 hyperintensities within the cervical and upper thoracic cord, focused on the anterior horns and intermediate gray matter. Lesions are non-enhancing and symmetrical, consistent with metabolic myelopathy.": 0.9976227283477783,
  "leighs disease in spinal cord and inferior colliculi|||New imaging confirms involvement of deep gray matter structures including the putamen and caudate, alongside known brainstem and spinal findings. This spatial distribution supports the diagnosis of Leigh’s Disease, a mitochondrial encephalopathy.": 0.9976580739021301,
  "leighs disease in spinal cord and inferior colliculi|||Leigh’s Disease is a mitochondrial subacute necrotizing encephalomyelopathy, radiologically marked by symmetric T2 hyperintensities in gray matter-rich regions including the spinal cord, brainstem, and basal ganglia.": 0.9976666569709778,
  "leighs disease in spinal cord and inferior colliculi|||This entity represents a neurodegenerative metabolic disorder involving central nervous system gray matter. The imaging constellation—brainstem, basal ganglia, and spinal cord lesions—supports Leigh’s Disease.": 0.9976708292961121,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||An MRCP image shows a vertically elongated gallbladder with the distal common bile duct coursing inferomedially and entering the duodenum at an unusually low position. The deviation from typical posterolateral orientation supports the diagnosis of Low Medial Insertion of Common Bile Duct with Pancreas Divisum.": 0.9977188110351562,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||Axial T2-weighted imaging demonstrates a distinct separation between the dorsal and ventral pancreatic ducts, with the dominant dorsal duct draining via the minor papilla. No fusion is observed at the pancreatic head, consistent with complete pancreas divisum.": 0.9976837038993835,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||A coronal reconstruction reveals inferior angulation of the distal common bile duct, deviating from normal trajectory and inserting at a lower-than-expected duodenal site. The insertion occurs medially to the expected ampullary region, supporting congenital ductal variation.": 0.9977518916130066,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||The duct of Santorini appears prominently on MRCP, coursing anterior to the main pancreatic duct and draining into the minor papilla. This dorsal duct prominence, in conjunction with the attenuated ventral duct, reinforces the presence of pancreas divisum.": 0.9977163672447205,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||A multiplanar 3D MRCP sequence reveals a narrow extrahepatic bile duct inserting medially and caudally into the second portion of the duodenum. The distal portion of the CBD sharply angles and hugs the medial duodenal wall, confirming the abnormal low medial insertion.": 0.9977152347564697,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||The abnormal insertion site is localized to the distal common bile duct near the medial wall of the second portion of the duodenum. The bile duct course shows pronounced medial deviation and inferior angulation from the usual posterolateral trajectory.": 0.9977315068244934,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||The dorsal pancreatic duct is enlarged and drains into the minor papilla, while the ventral duct is hypoplastic and non-communicating. The separation is anatomically centered within the pancreatic head and neck, sparing the body and tail.": 0.9977177381515503,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||Ductal non-union is clearly demonstrated around the ampullary region, where both pancreatic ductal systems and the bile duct maintain independent courses and insertions. This anomalous convergence pattern confirms a congenital biliopancreatic drainage anomaly.": 0.9977320432662964,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||This entity is a congenital anomaly involving aberrant bile duct insertion combined with pancreatic ductal non-fusion. It belongs to the category of biliary-pancreatic ductal variants and often presents with idiopathic recurrent pancreatitis.": 0.9977238774299622,
  "low medial insertion of common bile duct with pancreas divisum-20240916t165825z-001|||Radiologically, this condition is categorized under congenital ductal drainage disorders. It mimics ampullary stenosis or distal CBD obstruction and requires MRCP for definitive diagnosis due to the absence of mass effect or intrinsic ductal narrowing.": 0.9977111220359802,
  "lumbosacral plexitis|||An MRI image shows asymmetric T2 hyperintensity and fusiform thickening of the right lumbosacral plexus, extending from the L5–S1 roots into the sciatic notch. The affected nerves exhibit smooth, non-nodular margins without perineural edema, consistent with subacute Lumbosacral Plexitis.": 0.9976375699043274,
  "lumbosacral plexitis|||Axial fat-suppressed images demonstrate moderate hyperintensity along the left sacral plexus, with trace enhancement of nerve fascicles. No surrounding soft tissue mass or adjacent muscular atrophy is noted. These findings support an inflammatory plexopathy over infiltrative or compressive etiologies.": 0.9976560473442078,
  "lumbosacral plexitis|||Coronal MRI reveals bilateral, but asymmetric involvement of the lumbosacral nerve roots, with right-side predominance. Nerve bundles are mildly thickened and hyperintense on T2, without enhancement or discrete lesion. These features are classic for idiopathic or immune-mediated plexitis.": 0.9976332187652588,
  "lumbosacral plexitis|||Sagittal images through the pelvis reveal high T2 signal in the presacral neural bundles, tracking toward the greater sciatic foramen. Nerve morphology is preserved, and there is no adjacent lymphadenopathy or fluid collection, supporting isolated plexitis without mass effect.": 0.9976610541343689,
  "lumbosacral plexitis|||MRI sequences show focal high T2 signal localized to the proximal femoral nerve division, with preservation of fascicular continuity. The affected segment demonstrates mild thickening without surrounding edema or enhancement, consistent with focal Lumbosacral Plexitis.": 0.9976590275764465,
  "lumbosacral plexitis|||Lumbosacral Plexitis most often presents with unilateral involvement of the L4–S1 roots, extending into the sciatic or femoral nerve territory. MRI typically reveals T2 hyperintensity and nerve enlargement without mass, with enhancement variable depending on disease phase.": 0.9976560473442078,
  "lumbosacral plexitis|||The disease characteristically involves the retroperitoneal segment of the lumbosacral plexus, spanning from the lumbosacral trunk through the sciatic notch. On MRI, signal changes are patchy and fascicular, with no contiguous mass or compressive structure, helping distinguish from tumor or abscess.": 0.9976478219032288,
  "lumbosacral plexitis|||Most lesions are non-nodular, segmental, and asymmetric, confined to neural tissue. Absence of bone marrow, lymphatic, or muscular involvement further confirms the plexogenic origin and helps exclude lymphoma, metastasis, or psoas abscess.": 0.9976580142974854,
  "lumbosacral plexitis|||Lumbosacral Plexitis is an inflammatory neuropathy, falling under the category of non-compressive plexopathies. MRI shows asymmetric nerve thickening and T2 hyperintensity without nodularity or enhancement, distinguishing it from infiltrative or neoplastic causes.": 0.9976664781570435,
  "lumbosacral plexitis|||This entity represents a mononeuritis multiplex variant of immune-mediated peripheral neuropathy, often post-infectious or diabetic. Imaging findings—nerve fascicle hyperintensity, segmental swelling, and fascicular preservation—are key for diagnosis and exclusion of malignancy.": 0.997664213180542,
  "magnetic resonance (mr) brain|||An MRI image demonstrating multiple hyperintense foci in the periventricular and subcortical white matter bilaterally on T2-weighted imaging. These lesions are irregular but well-defined, suggesting chronic microvascular ischemic changes rather than active demyelination.": 0.9976385235786438,
  "magnetic resonance (mr) brain|||Marked cortical atrophy is seen with widened sulci and enlarged lateral ventricles, most prominent in the frontal and parietal lobes. The diffuse nature and absence of focal lesions favor an age-related degenerative process.": 0.9976638555526733,
  "magnetic resonance (mr) brain|||A sagittal T2-weighted view reveals thinning of the corpus callosum with preserved midline alignment. The fornix and surrounding ventricular system appear mildly dilated, reinforcing generalized cerebral volume loss.": 0.9976425766944885,
  "magnetic resonance (mr) brain|||Coronal images highlight symmetric cerebellar folia widening and vermian atrophy without abnormal signal or mass effect, suggestive of chronic cerebellar degeneration rather than posterior fossa pathology.": 0.9976426959037781,
  "magnetic resonance (mr) brain|||Multiplanar images show no evidence of mass lesions, hemorrhage, or diffusion restriction. Basal ganglia, thalamus, and brainstem signal intensity remains within normal range, excluding acute infarction or metabolic encephalopathy.": 0.9976417422294617,
  "magnetic resonance (mr) brain|||White matter lesions are concentrated in the periventricular zones and deep centrum semiovale, exhibiting bilateral but slightly asymmetric distribution. This pattern is typical of chronic ischemic small vessel disease and helps exclude active inflammatory demyelination.": 0.9976489543914795,
  "magnetic resonance (mr) brain|||Cerebral atrophy is diffuse and affects both cortical and subcortical regions. Frontal and parietal lobes are most involved, with mild ventricular enlargement and sulcal widening, indicative of global neurodegeneration.": 0.9976770281791687,
  "magnetic resonance (mr) brain|||The posterior fossa shows symmetric cerebellar volume loss without signal abnormality in the brainstem or fourth ventricle compression, supporting a chronic, non-obstructive process localized to the cerebellar hemispheres and vermis.": 0.9976413249969482,
  "magnetic resonance (mr) brain|||MR Brain findings align with chronic neurovascular and degenerative conditions. The lack of diffusion restriction, ring enhancement, or focal mass excludes acute infarction, demyelination, or neoplasia.": 0.9976396560668945,
  "magnetic resonance (mr) brain|||The imaging features are consistent with chronic microangiopathy and age-related cortical atrophy, supporting classification under small vessel disease and neurodegenerative spectrum. There is no radiologic evidence for active inflammatory, infectious, or neoplastic processes.": 0.9976506233215332,
  "magnetic resonance (mr) spine|||An MRI sagittal image shows degenerative changes in the medial tibiofemoral compartment with subchondral hypointensity and irregular joint space, suggestive of early osteoarthritic changes. Adjacent mild joint effusion and posterior meniscal degeneration are also noted.": 0.997655987739563,
  "magnetic resonance (mr) spine|||An axial T2-weighted image reveals symmetric musculature with intact epidural fat plane, no focal hyperintensity within the spinal cord, and preserved vertebral alignment.": 0.9976619482040405,
  "magnetic resonance (mr) spine|||Coronal MR images of the cervical spine show mild vertebral body rotation with preservation of disc space height and no visible foraminal encroachment.": 0.9976761937141418,
  "magnetic resonance (mr) spine|||A sagittal MR image reveals moderate disc desiccation at the L5-S1 level with associated posterior disc bulge indenting the ventral aspect of the thecal sac.": 0.9976904392242432,
  "magnetic resonance (mr) spine|||Multiple sagittal and coronal images show intact ligamentous structures with no evidence of ligamentum flavum hypertrophy, anterior osteophyte formation, or facet joint effusion.": 0.9976927638053894,
  "magnetic resonance (mr) spine|||Degenerative changes are most prominent at L5-S1, with posterior disc protrusion and disc dehydration seen on T2-weighted sequences.": 0.9976767897605896,
  "magnetic resonance (mr) spine|||The cervical spine images demonstrate preserved vertebral alignment and no significant curvature abnormalities, fracture, or listhesis.": 0.9977207183837891,
  "magnetic resonance (mr) spine|||Peripheral coronal images capturing adjacent musculoskeletal structures reveal early osteoarthritic degeneration of the knee, including subchondral changes and mild joint effusion.": 0.9976845383644104,
  "magnetic resonance (mr) spine|||The MRI findings are consistent with localized degenerative spine disease, including disc desiccation and disc bulging at L5-S1, without evidence of myelopathy or mass lesion.": 0.9976596236228943,
  "magnetic resonance (mr) spine|||Based on current imaging, the presentation aligns with mechanical degenerative pathology rather than a systemic inflammatory or neoplastic process.": 0.9976924657821655,
  "moyamoya disease with intraventricular hemorrhage|||An MRI image demonstrates acute intraventricular hemorrhage as T2 hypointense material layering in the atrium and occipital horns, with surrounding periventricular FLAIR hyperintensity. Associated vascular flow voids in the basal cisterns confirm the diagnosis of Moyamoya Disease with secondary hemorrhage.": 0.9976623058319092,
  "moyamoya disease with intraventricular hemorrhage|||A contrast-enhanced MR angiography image reveals marked bilateral narrowing of the distal internal carotid arteries, with dense collateral networks from lenticulostriate and thalamoperforating arteries, forming the characteristic “puff of smoke” appearance of Moyamoya Disease.": 0.9976935386657715,
  "moyamoya disease with intraventricular hemorrhage|||SWI sequences show multiple susceptibility artifacts in the periventricular white matter and deep nuclei, reflecting chronic microhemorrhages and hemosiderin deposition. These findings suggest repeated bleeding events secondary to fragile Moyamoya collaterals.": 0.9976720809936523,
  "moyamoya disease with intraventricular hemorrhage|||A coronal T2-weighted MRI slice displays ventricular enlargement and hemosiderin staining around the third ventricle, consistent with previous intraventricular hemorrhage. Adjacent thalamic signal dropout and basal ganglia vessel flow voids further support Moyamoya vasculopathy.": 0.9976584315299988,
  "moyamoya disease with intraventricular hemorrhage|||3D MRA reconstruction demonstrates extensive collateral reconstitution of the circle of Willis, including prominent choroidal and pericallosal collaterals. In this context, intraventricular hemorrhage is likely due to rupture of deep-seated periventricular collaterals, characteristic of advanced Moyamoya Disease.": 0.9976955652236938,
  "moyamoya disease with intraventricular hemorrhage|||Hemorrhage localizes most frequently to the posterior horns and atria of the lateral ventricles, with signal abnormalities extending into the periventricular white matter. This spatial distribution, seen on T2 and FLAIR images, suggests rupture of deep collateral channels in Moyamoya Disease.": 0.99766606092453,
  "moyamoya disease with intraventricular hemorrhage|||Collateral vessels are predominantly visualized in the basal ganglia, thalamus, and periventricular region, with associated flow voids and contrast-enhanced serpiginous structures. The bilateral, symmetric involvement distinguishes Moyamoya Disease from focal vascular anomalies like AVMs or aneurysms.": 0.9976578950881958,
  "moyamoya disease with intraventricular hemorrhage|||Chronic changes include ventricular enlargement, hemosiderin staining, and microbleeds, particularly around the third ventricle and pericallosal region. These MRI findings support a recurrent hemorrhagic pattern linked to fragile periventricular neovascular networks in Moyamoya Disease.": 0.9976807832717896,
  "moyamoya disease with intraventricular hemorrhage|||Moyamoya Disease is a non-atherosclerotic occlusive arteriopathy, affecting the terminal internal carotid arteries and characterized by compensatory collateral vessel formation. Intraventricular hemorrhage results from rupture of deep collateral networks.": 0.9976946115493774,
  "moyamoya disease with intraventricular hemorrhage|||This disease falls under progressive cerebrovascular occlusive syndromes, often idiopathic or linked to RNF213 mutations. The presence of intraventricular hemorrhage in the absence of aneurysm or AVM strongly supports Moyamoya Disease on MRI.": 0.9976889491081238,
  "myositis ossificans progressiva|||Sagittal MRI images display mature, corticated ossifications aligned with posterior cervical paraspinal muscles. These appear as well-defined, hypointense streaks on T2-weighted imaging, sparing spinal cord and intervertebral neural pathways—consistent with chronic-stage heterotopic ossification.": 0.9976491332054138,
  "myositis ossificans progressiva|||Axial slices through the lower medulla and upper cervical spine highlight low-signal lesions along both the posterior and lateral musculature, including the longissimus and levator scapulae. These calcifications remain sharply marginated and maintain fascial respect, excluding diffuse inflammatory or infiltrative pathology.": 0.9976483583450317,
  "myositis ossificans progressiva|||Coronal imaging demonstrates bilateral ossified tracts near the suboccipital region, coursing inferiorly through the nuchal musculature. Their organized architecture and lack of surrounding edema reinforce a diagnosis of stable, mature ossification.": 0.9976453185081482,
  "myositis ossificans progressiva|||Sagittal sections show isolated hypointense nodules near the costovertebral angles at upper thoracic levels. These are consistent with enthesopathic ossification extending into deep muscle origins, with no mass effect or active inflammation.": 0.9976534247398376,
  "myositis ossificans progressiva|||High-resolution T2 axial imaging reveals circumferential ossification involving posterior and anterolateral compartments of the neck. Despite increased disease burden, adjacent vascular and neural structures remain uninvolved, supporting the benign but progressive nature of MOP.": 0.9976576566696167,
  "myositis ossificans progressiva|||Ossification involves cervical paraspinal muscles bilaterally, now with clear extension into lateral muscular planes, including splenius, scalene, and semispinalis groups. Lesions remain extra-axial, with no encroachment upon spinal cord or neural foramina.": 0.9976849555969238,
  "myositis ossificans progressiva|||Heterotopic ossification is primarily distributed in the posterior cervical and upper thoracic regions, with additional anterior engagement at the thoracic inlet. Coronal sections suggest symmetrical involvement, without displacement of airway or major vascular structures.": 0.9976902008056641,
  "myositis ossificans progressiva|||No supratentorial, brainstem, or spinal cord parenchymal abnormalities are noted. All pathological changes remain within the musculoskeletal envelope, following known enthesis zones, with progressive ossification tracking fascial and connective tissue boundaries.": 0.9976699352264404,
  "myositis ossificans progressiva|||Myositis Ossificans Progressiva is a congenital connective tissue disorder manifesting as progressive heterotopic ossification. MRI findings remain confined to soft tissue planes, aiding exclusion of neoplastic, demyelinating, or inflammatory CNS diseases.": 0.9976783990859985,
  "myositis ossificans progressiva|||MOP represents a systemic ossification disorder, classifiable under musculoskeletal dysplasias. Neuroimaging consistently shows extra-axial involvement with preserved central structures, distinguishing it from neurodegenerative or compressive syndromes.": 0.9977025389671326,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||An MRI image shows bilateral T2 hyperintense lesions in the optic chiasm and optic tracts, with mild enlargement and no contrast enhancement. The lesions follow the expected anatomical pathways without mass effect or hemorrhage, consistent with low-grade optic gliomas in NF1.": 0.9976477026939392,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||FLAIR and T2-weighted images demonstrate multiple symmetric, patchy hyperintensities in the basal ganglia, cerebellar hemispheres, and thalami. These non-enhancing lesions are consistent with unidentified bright objects (UBOs), typical in pediatric NF1, and show no mass effect or diffusion restriction.": 0.997628390789032,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||High-resolution coronal T2 images reveal slight expansion and hyperintensity of the hypothalamic region and posterior optic apparatus. No necrosis or perilesional edema is seen, favoring a benign low-grade astrocytoma rather than a high-grade glioma.": 0.9976339936256409,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||Axial images show punctate hyperintensities in the subcortical white matter of the frontal and parietal lobes, symmetrically distributed. These are stable and non-progressive in NF1 and help distinguish them from demyelinating or vascular etiologies.": 0.9976332187652588,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||MRI shows subtle, non-enhancing nodular foci at the anterior midbrain and along the periventricular white matter. These exhibit no mass effect or restricted diffusion, consistent with the multifocal gliotic or hamartomatous changes frequently seen in NF1.": 0.9976404309272766,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||Optic pathway gliomas involve the optic nerves, chiasm, and tracts, often extending into the hypothalamus. These appear as T2 hyperintense, non-enhancing, and fusiform in morphology. Extension beyond the optic chiasm is well-demarcated, with no invasion into adjacent brain structures.": 0.9976678490638733,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||Unidentified bright objects (UBOs) are symmetrically distributed in the basal ganglia, thalamus, midbrain, and cerebellar white matter. These lesions are hyperintense on T2 and FLAIR, lack enhancement, and remain stable or regress over time—hallmarks of NF1.": 0.9976682066917419,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||There is no cortical atrophy or abnormal contrast enhancement suggestive of high-grade neoplasm. Lesions remain extra-axial or confined to white matter tracts, without diffusion restriction or elevated perfusion—supporting a benign neurocutaneous disease rather than an infiltrative or inflammatory disorder.": 0.997640073299408,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||NF1 with optic glioma is a phakomatosis within the spectrum of neurocutaneous tumor syndromes. The gliomas are typically WHO grade I astrocytomas, characterized by slow progression and non-enhancing, T2-hyperintense morphology.": 0.997687578201294,
  "neurofibromatosis type 1 (nf1) with optic glioma and intracranial extension|||MRI aids in differentiating NF1 from optic neuritis or aggressive gliomas through its hallmark features: bilateral UBOs, non-enhancing optic gliomas, and lack of restricted diffusion, cortical atrophy, or mass effect.": 0.9976564049720764,
  "optic glioma|||An MRI image demonstrates marked fusiform thickening and T2 hyperintensity of the right intraorbital optic nerve, extending from the posterior globe to the orbital apex. The lesion lacks contrast enhancement and restricted diffusion, confirming the imaging pattern of a stable low-grade optic glioma.": 0.9976370930671692,
  "optic glioma|||Coronal T2-weighted images show asymmetric enlargement of the right optic nerve with central hyperintensity and preserved perineural CSF rim. The signal is homogeneous, with no adjacent fat stranding or inflammation, consistent with an anterior segment Optic Glioma.": 0.9976412653923035,
  "optic glioma|||Axial images reveal involvement of the prechiasmatic optic nerve, appearing hyperintense and expanded. There is no mass effect on the optic chiasm or hypothalamus, and the lesion remains non-enhancing, supporting a localized, indolent astrocytoma of the optic pathway.": 0.9976418018341064,
  "optic glioma|||Multiplanar MRI reveals a smooth-contoured, hyperintense mass along the optic nerve in both axial and sagittal views. The lesion is confined to the orbital canal and shows no nodularity or calcification, distinguishing it from inflammatory or metastatic optic neuropathies.": 0.9976468086242676,
  "optic glioma|||A coronal FLAIR image demonstrates bilateral optic nerve hyperintensity, more prominent on the right. Although fusiform in shape, the lesion displays no contrast enhancement or perineural edema, supporting the diagnosis of a bilateral optic pathway glioma, potentially associated with NF1.": 0.9976379871368408,
  "optic glioma|||The optic gliomas in this case involve the intraorbital and prechiasmatic segments of the optic nerves, with no visible extension to the optic chiasm or posterior visual pathways. Lesions remain localized and extra-axial, demonstrating fusiform morphology and T2 hyperintensity.": 0.9976626634597778,
  "optic glioma|||Laterality is asymmetric, with right-sided dominance in intraorbital optic nerve involvement. No abnormal signal is observed in the optic tracts, thalamus, or adjacent white matter, excluding posterior extension or intracranial infiltration.": 0.9976514577865601,
  "optic glioma|||There is no cortical, basal ganglia, or brainstem involvement. The imaging pattern remains isolated to the anterior visual pathways, with no associated mass effect, calcification, or enhancement—supporting a non-aggressive, low-grade classification.": 0.9976559281349182,
  "optic glioma|||Optic gliomas are low-grade pilocytic astrocytomas (WHO grade I) affecting the visual pathway, often seen in children. MRI shows classic fusiform thickening with T2 hyperintensity and no enhancement, confirming their benign, slow-growing nature.": 0.9976590871810913,
  "optic glioma|||These tumors are classified under primary CNS gliomas. Imaging distinguishes them from optic neuritis, sarcoidosis, and lymphoma by their non-enhancing, non-restrictive nature and chronic fusiform morphology, often with orbital confinement.": 0.9976598024368286,
  "osmotic demyelination syndrome|||An MRI image shows a central pontine lesion with symmetric T2/FLAIR hyperintensity sparing the peripheral pontine fibers. The lesion produces a classic trident-shaped appearance without associated diffusion restriction or contrast enhancement, consistent with central pontine myelinolysis in Osmotic Demyelination Syndrome.": 0.9976411461830139,
  "osmotic demyelination syndrome|||Coronal T2-weighted images demonstrate bilateral symmetric hyperintensities in the basal ganglia and thalamus. The signal abnormalities are non-enhancing and lack restricted diffusion, supporting extrapontine myelinolysis as part of Osmotic Demyelination Syndrome.": 0.9976367950439453,
  "osmotic demyelination syndrome|||Axial MRI slices reveal patchy T2 hyperintensity in the internal capsules and cerebellar white matter, with preservation of the adjacent gray matter and no surrounding edema. The distribution and signal characteristics are typical for extrapontine involvement in ODS.": 0.9976348280906677,
  "osmotic demyelination syndrome|||An MRI image shows confluent hyperintense signal on FLAIR within the midbrain and pontine tegmentum. The lesion is non-enhancing, and the absence of mass effect or hemorrhage helps differentiate it from neoplastic or vascular brainstem pathologies.": 0.9976407885551453,
  "osmotic demyelination syndrome|||Sagittal views demonstrate a central pontine lesion with increased T2 signal intensity that respects the pontine periphery. The imaging pattern, along with the absence of ring enhancement or diffusion abnormality, supports a diagnosis of central pontine myelinolysis in the context of Osmotic Demyelination Syndrome.": 0.9976453185081482,
  "osmotic demyelination syndrome|||The central pons is the most consistently affected region in ODS, demonstrating symmetric hyperintensity on T2/FLAIR with sparing of the corticospinal tracts peripherally. No mass effect or enhancement is seen, making this pattern highly specific for central pontine myelinolysis.": 0.9976548552513123,
  "osmotic demyelination syndrome|||Extrapontine lesions involve the bilateral basal ganglia, thalami, and cerebellar white matter, typically symmetric and non-enhancing. These are better visualized on T2-weighted and FLAIR sequences and can occur in isolation or alongside pontine involvement.": 0.9976457357406616,
  "osmotic demyelination syndrome|||The cerebral cortex, corpus callosum, and hippocampi are spared. No abnormal contrast enhancement, mass effect, or diffusion restriction is noted. The topography supports a toxic-metabolic demyelinating process rather than ischemic or inflammatory causes.": 0.9976486563682556,
  "osmotic demyelination syndrome|||Osmotic Demyelination Syndrome is a toxic-metabolic, acquired demyelinating disorder classically associated with rapid correction of hyponatremia. It includes central pontine and extrapontine myelinolysis, both evident as non-enhancing, symmetric T2/FLAIR hyperintensities.": 0.9976899027824402,
  "osmotic demyelination syndrome|||MRI findings in ODS—central pontine and extrapontine T2-hyperintense lesions without enhancement—differentiate it from infarction, tumor, or infectious encephalitis. Lesion symmetry and lack of mass effect are critical diagnostic clues.": 0.9976491332054138,
  "pachygyria with cerebellar hypoplasia|||Axial MR images reveal markedly thickened cortical ribbon and reduced sulcal depth, predominantly in the bilateral frontoparietal lobes. The gyri are broad, flattened, and disorganized, showing a smooth cortical contour without normal gyral complexity—hallmarks of classic pachygyria.": 0.9976555109024048,
  "pachygyria with cerebellar hypoplasia|||Mid-sagittal and axial views demonstrate severe cerebellar hypoplasia with near-complete vermian agenesis. The posterior fossa appears enlarged with upward rotation of the brainstem, and there is no folial pattern evident, supporting congenital cerebellar underdevelopment.": 0.9976593852043152,
  "pachygyria with cerebellar hypoplasia|||T1-weighted sagittal images display blunted cortical folding and reduced white-gray matter differentiation, especially near the central sulcus. The ventricular system is mildly dilated, likely secondary to parenchymal volume loss without evidence of obstructive pathology.": 0.9976385235786438,
  "pachygyria with cerebellar hypoplasia|||Coronal sections through the supratentorial brain show bilateral and symmetric pachygyric changes, with simplified gyral patterns and thickened cortex exceeding 5 mm. There is no periventricular leukomalacia or calcification, supporting a migrational anomaly rather than an acquired insult.": 0.9976381063461304,
  "pachygyria with cerebellar hypoplasia|||New sagittal slices reveal reduced anterior-posterior cerebellar dimension, thinning of the corpus callosum, and absence of normal posterior fossa landmarks. No abnormal enhancement or mass lesions are seen, confirming the congenital and non-progressive nature of the disease.": 0.997647225856781,
  "pachygyria with cerebellar hypoplasia|||Pachygyria affects the bilateral frontal and parietal lobes most prominently, with symmetric cortical thickening and shallow sulci. Occipital lobes appear relatively spared, suggesting an anterior-predominant migrational disorder.": 0.9976859092712402,
  "pachygyria with cerebellar hypoplasia|||Cerebellar hypoplasia involves both hemispheres and the vermis, with near-complete loss of normal cerebellar folia. The posterior fossa is expanded and the fourth ventricle is enlarged due to volume loss, not hydrocephalus.": 0.9976803064346313,
  "pachygyria with cerebellar hypoplasia|||Corpus callosum thinning and mild lateral ventricular enlargement are observed, likely secondary to reduced cortical and cerebellar volume. These features confirm a widespread congenital neurodevelopmental disorder rather than an acquired or progressive pathology.": 0.9976610541343689,
  "pachygyria with cerebellar hypoplasia|||This condition represents a congenital cortical malformation under the neuronal migration disorder group, with associated posterior fossa anomaly. The imaging is consistent with lissencephaly spectrum disorders, often linked to genetic etiologies such as LIS1 or RELN mutations.": 0.9976946711540222,
  "pachygyria with cerebellar hypoplasia|||Radiologically, the symmetric, non-enhancing cortical thickening with cerebellar hypoplasia supports a static developmental anomaly. Lack of diffusion restriction, hemorrhage, or contrast enhancement helps differentiate from perinatal injury or metabolic encephalopathies.": 0.9976635575294495,
  "perisylvian syndrome|||Axial and coronal MR images demonstrate bilateral cortical thickening and irregular gyration along the perisylvian regions, with a pronounced wavy and serrated cortical contour. The Sylvian fissures are shallow and abnormally horizontal, consistent with bilateral perisylvian polymicrogyria.": 0.9976410269737244,
  "perisylvian syndrome|||High-resolution axial images reveal numerous small gyri forming a cobblestone-like pattern centered around the opercular and insular regions. The cortex appears thickened and disorganized, lacking normal gray-white matter differentiation—hallmarks of polymicrogyria in Perisylvian Syndrome.": 0.9976423382759094,
  "perisylvian syndrome|||Sagittal sections show incomplete opercularization of the insula and distorted architecture in the posterior frontal and anterior parietal cortices. No signs of mass effect or enhancement are seen, reinforcing the congenital and non-progressive nature of the cortical malformation.": 0.9976512789726257,
  "perisylvian syndrome|||Multiplanar sequences confirm symmetric involvement of the perisylvian zones with extensive cortical dyslamination. The imaging shows no abnormal diffusion restriction or contrast uptake, and the white matter architecture remains otherwise preserved, excluding ischemic or inflammatory etiologies.": 0.9976438283920288,
  "perisylvian syndrome|||T1-weighted axial and sagittal images reveal a continuous band of polymicrogyria extending from the posterior frontal lobe into the lateral temporal region. The Sylvian fissures are abnormally wide and shallow, with reduced insular coverage, producing the 'bare insula' appearance.": 0.997644305229187,
  "perisylvian syndrome|||Polymicrogyria is symmetrically distributed around both Sylvian fissures, extending into the opercular, insular, and lateral frontal and parietal cortices. The Sylvian fissures are horizontal and dysplastic, aiding in recognition of this specific malformation pattern.": 0.997673749923706,
  "perisylvian syndrome|||Cortical abnormalities are restricted to the perisylvian regions, with sparing of the medial hemispheres and occipital lobes. This distribution helps differentiate it from diffuse or global migrational disorders such as pachygyria or schizencephaly.": 0.9976493120193481,
  "perisylvian syndrome|||Insular cortex hypoplasia and incomplete opercularization are consistently observed bilaterally. The lack of abnormal signal in subcortical white matter and basal ganglia further supports a focal, static malformation consistent with perisylvian polymicrogyria.": 0.9976472854614258,
  "perisylvian syndrome|||Perisylvian Syndrome is a bilateral polymicrogyria variant under the category of malformations of cortical development (MCD). It is characterized by symmetric opercular and insular dysplasia without signs of progression.": 0.9976808428764343,
  "perisylvian syndrome|||MRI findings are classic for a congenital, static neuronal migration anomaly. Bilateral perisylvian polymicrogyria with preserved white matter and no diffusion or enhancement effectively rules out acquired or progressive pathologies.": 0.9976555705070496,
  "pigmented villonodular synovitis (pvns) of ankle|||An MRI image showing a multilobulated, low-signal intensity mass along the anterior and medial ankle joint, with blooming artifact on susceptibility-weighted sequences. The presence of hemosiderin deposition and joint effusion is consistent with Pigmented Villonodular Synovitis (PVNS) of the Ankle.": 0.9976499080657959,
  "pigmented villonodular synovitis (pvns) of ankle|||An MRI image demonstrating a dense, heterogeneous mass extending posteriorly along the flexor tendon sheath, exhibiting low signal on T2-weighted images. The signal voids and irregular margins are indicative of hemosiderin-laden synovial proliferation characteristic of diffuse PVNS.": 0.9976472854614258,
  "pigmented villonodular synovitis (pvns) of ankle|||An MRI image showing a well-defined intra-articular mass centered over the anterior tibiotalar recess with pressure erosion along the talar dome and medial malleolus, reflecting aggressive synovial hypertrophy typical of PVNS.": 0.9976789355278015,
  "pigmented villonodular synovitis (pvns) of ankle|||An MRI image reveals a large, irregular synovial-based lesion encasing the talus, with adjacent bony scalloping and soft tissue expansion toward the subtalar joint. This mass demonstrates internal hypointensities from hemosiderin accumulation.": 0.9976466298103333,
  "pigmented villonodular synovitis (pvns) of ankle|||An MRI image displaying mass-like synovial thickening extending into the posterior ankle gutter with surrounding joint effusion. The lesion’s susceptibility artifact on GRE/T2* imaging strongly supports the diagnosis of Pigmented Villonodular Synovitis.": 0.9976690411567688,
  "pigmented villonodular synovitis (pvns) of ankle|||The disease involves the anterior and medial tibiotalar joint recesses, with extension along the subtalar articulation. Notably, erosion at the talar neck and medial malleolus confirms localized bone involvement adjacent to the hypertrophied synovium.": 0.9977047443389893,
  "pigmented villonodular synovitis (pvns) of ankle|||There is circumferential proliferation of abnormal synovium, prominently along the flexor retinaculum and posterior tibiotalar gutter. The mass shows periarticular extension with tendon sheath involvement, suggesting diffuse PVNS with extra-articular infiltration.": 0.9976763129234314,
  "pigmented villonodular synovitis (pvns) of ankle|||The hypertrophic synovium extends inferiorly from the joint space into the sinus tarsi and posterior calcaneal recess, with osseous remodeling of the adjacent talus. This pattern is consistent with erosive tenosynovial expansion in PVNS.": 0.9977084398269653,
  "pigmented villonodular synovitis (pvns) of ankle|||PVNS is a benign proliferative synovial neoplasm, most often diffuse in the ankle. MRI features such as blooming artifact and osseous erosion distinguish it from inflammatory arthropathies and synovial chondromatosis.": 0.997660219669342,
  "pigmented villonodular synovitis (pvns) of ankle|||Classified under benign synovial-based tumors, PVNS manifests as hemosiderin-rich proliferative lesions. MRI is key for diagnosis and surgical planning, particularly due to frequent tendon sheath and bone involvement.": 0.9976552128791809,
  "plexiform neurofibroma with sphenoid wing absence|||An MRI image shows a large, infiltrative, lobulated soft tissue mass in the left orbitotemporal region with serpiginous internal architecture and marked T2 hyperintensity, displacing orbital contents and extending into the masticator space—consistent with plexiform neurofibroma.": 0.9976527094841003,
  "plexiform neurofibroma with sphenoid wing absence|||Axial and coronal views reveal complete agenesis of the left sphenoid wing with herniation of the anterior temporal lobe into the orbit. This is accompanied by an adjacent non-enhancing, infiltrative lesion encasing the optic nerve and adjacent muscles, causing pronounced globe proptosis.": 0.9976674914360046,
  "plexiform neurofibroma with sphenoid wing absence|||Coronal T2-weighted images demonstrate severe bony dysplasia, extracranial soft tissue expansion, and deformation of the left hemiface. The lesion has poorly defined margins, high signal intensity, and lacks post-contrast enhancement, features typical of a plexiform neurofibroma.": 0.9976251721382141,
  "plexiform neurofibroma with sphenoid wing absence|||Sagittal sequences confirm a large, T2-hyperintense lesion extending along the trigeminal nerve path with orbital floor remodeling and involvement of periorbital and infratemporal compartments. The optic canal on the affected side is narrowed but patent, without optic nerve atrophy.": 0.9976547956466675,
  "plexiform neurofibroma with sphenoid wing absence|||Multiplanar MRI reveals profound asymmetry of the anterior skull base with dural protrusion into the orbit through a bony defect. No signs of mass effect, restricted diffusion, or hemorrhage are identified, consistent with a slow-growing, congenital lesion of neurofibromatous origin.": 0.9976325035095215,
  "plexiform neurofibroma with sphenoid wing absence|||The lesion is unilateral, left-sided, involving the orbit, infratemporal fossa, and masticator space, with contiguous spread along cranial nerve V branches. The mass is associated with absence of the left greater sphenoid wing, a hallmark of NF1-related dysplasia.": 0.9976620078086853,
  "plexiform neurofibroma with sphenoid wing absence|||MRI shows significant soft tissue expansion with infiltration into deep facial compartments and temporal lobe herniation through the lateral orbital wall. The intracranial compartment remains preserved, without midline shift or ventricular distortion.": 0.997657299041748,
  "plexiform neurofibroma with sphenoid wing absence|||The sphenoid defect leads to encephalocele formation and protrusion of the temporal lobe, clearly visible in coronal and sagittal planes. The right skull base and orbit remain anatomically intact, reinforcing the asymmetric and congenital nature of this presentation.": 0.9976685047149658,
  "plexiform neurofibroma with sphenoid wing absence|||This represents a congenital neurocutaneous disorder under the spectrum of neurofibromatosis type 1, combining a benign plexiform neurofibroma with associated sphenoid wing agenesis and secondary encephalocele.": 0.9976884126663208,
  "plexiform neurofibroma with sphenoid wing absence|||Imaging reveals a slowly progressive, T2-bright, non-enhancing plexiform neurofibroma with osseous dysplasia. The absence of aggressive features or restricted diffusion aids differentiation from malignant transformation or infectious processes.": 0.9976598620414734,
  "rasmussens encephalitis|||An MRI image showing extensive T2/FLAIR hyperintensity in the left frontoparietal cortex with indistinct gray-white matter margins and mild gyral swelling, consistent with early active inflammatory changes in Rasmussen’s Encephalitis.": 0.9976557493209839,
  "rasmussens encephalitis|||Axial and coronal T2-weighted sequences demonstrate progressive left hemispheric cortical atrophy, notably in the perirolandic and temporal regions, with ipsilateral ventricular dilatation and sulcal prominence—hallmarks of chronic Rasmussen’s Encephalitis.": 0.9976397752761841,
  "rasmussens encephalitis|||An MRI image reveals subtle left insular and perisylvian cortical hyperintensity with evolving volume loss, producing asymmetric hemispheric contours and gliosis, without diffusion restriction or enhancement, consistent with Rasmussen’s Encephalitis.": 0.9976487755775452,
  "rasmussens encephalitis|||Multiplanar imaging shows chronic atrophy of the left cerebral hemisphere, with preserved cerebellum and brainstem, absence of mass effect, and associated ex vacuo dilatation of the left lateral ventricle, typical of the atrophic phase of Rasmussen’s Encephalitis.": 0.9976398348808289,
  "rasmussens encephalitis|||T1-weighted and FLAIR sequences show regional left cortical thinning, loss of cortical ribbon clarity, and underlying subcortical white matter T2 hyperintensity in the parietal lobe, with no enhancement—supporting an autoimmune inflammatory etiology such as Rasmussen’s Encephalitis.": 0.9976409673690796,
  "rasmussens encephalitis|||Rasmussen’s Encephalitis typically affects one cerebral hemisphere—commonly the left—with predilection for the perirolandic, insular, and parietal cortex. The contralateral hemisphere remains structurally intact, reinforcing the highly asymmetric involvement.": 0.9976990222930908,
  "rasmussens encephalitis|||FLAIR and T2 sequences show progressive cortical and subcortical signal abnormalities in the affected hemisphere, accompanied by diffuse sulcal widening and ipsilateral ventricular enlargement. These findings evolve over time, aiding longitudinal diagnosis.": 0.9976320862770081,
  "rasmussens encephalitis|||There is no enhancement or diffusion restriction despite active cortical pathology. This imaging pattern helps exclude high-grade tumors, abscesses, and herpes simplex encephalitis, all of which often present with mass effect or contrast enhancement.": 0.9976388812065125,
  "rasmussens encephalitis|||Rasmussen’s Encephalitis is a rare, unilateral autoimmune inflammatory encephalitis of childhood, characterized by focal cortical inflammation and progressive hemiatrophy. MRI findings are non-enhancing and evolve from swelling to atrophy.": 0.997674822807312,
  "rasmussens encephalitis|||This disease falls under immune-mediated encephalitides. MRI patterns—unilateral cortical hyperintensity and volume loss without enhancement or restricted diffusion—help differentiate it from infections, tumors, and leukodystrophies.": 0.9976327419281006,
  "retinoblastoma with intracranial spread along cranial nerve|||MRI demonstrates a right-sided intraocular mass with low-to-intermediate T2 signal intensity, calcific foci, and posterior extension into the optic nerve. The retrobulbar segment is enlarged with tubular enhancement reaching the orbital apex—consistent with retinoblastoma involving cranial nerve II.": 0.9976494312286377,
  "retinoblastoma with intracranial spread along cranial nerve|||Axial and sagittal images show asymmetric thickening of the right optic nerve, with hyperintense T2 signal and contrast enhancement extending into the optic canal. The mass remains intraorbital but tracks along the nerve sheath, supporting perineural tumor spread.": 0.9976304769515991,
  "retinoblastoma with intracranial spread along cranial nerve|||Post-contrast sequences reveal irregular enhancement of the optic nerve extending through the optic canal and abutting the prechiasmatic region without chiasmal invasion. The intraocular lesion shows low signal core and peripheral enhancement, consistent with partially calcified retinoblastoma.": 0.9976633787155151,
  "retinoblastoma with intracranial spread along cranial nerve|||A coronal MRI image shows right orbital asymmetry with proptosis, an enhancing intraocular mass, and nodular thickening of the retrobulbar optic nerve. No contralateral findings are present. These features are highly suggestive of advanced retinoblastoma with nerve involvement.": 0.9976531863212585,
  "retinoblastoma with intracranial spread along cranial nerve|||High-resolution axial sequences reveal contiguous enhancement along the optic nerve sheath extending from the globe to the orbital apex. The lesion maintains a confined intraneural route without leptomeningeal spread, which favors retinoblastoma over metastatic or inflammatory optic neuropathies.": 0.9976478815078735,
  "retinoblastoma with intracranial spread along cranial nerve|||The lesion originates within the right globe and spreads posteriorly via the optic nerve. Involvement is confined to the ipsilateral nerve, including intraorbital and intracanalicular segments, with no evidence of bilateral or chiasmal spread on current imaging.": 0.9976504445075989,
  "retinoblastoma with intracranial spread along cranial nerve|||MRI demonstrates perineural tumor extension confined to the right cranial nerve II, with enhancement following the nerve to the optic canal. No transdural or leptomeningeal extension is visible. This pattern is characteristic of retinoblastoma with cranial nerve tracking.": 0.9976871013641357,
  "retinoblastoma with intracranial spread along cranial nerve|||No signal abnormality is noted in adjacent cerebral parenchyma, and the optic chiasm appears preserved. The isolated, unilateral pattern and lack of brain involvement differentiate this from primary CNS tumors and inflammatory optic neuritis.": 0.9976410269737244,
  "retinoblastoma with intracranial spread along cranial nerve|||This case represents a malignant neuroectodermal tumor (retinoblastoma) with extraocular extension through cranial nerve II. Imaging reveals contiguous optic nerve spread, essential for staging and surgical decision-making.": 0.9977028369903564,
  "retinoblastoma with intracranial spread along cranial nerve|||MRI shows unilateral intraocular malignancy with cranial nerve invasion but no chiasmal or parenchymal spread. This radiologic pattern excludes bilateral retinoblastoma, CNS metastases, or demyelinating optic neuropathies.": 0.9976680874824524,
  "right brachial plexitis|||An MRI image demonstrates diffuse, asymmetric T2 hyperintensity and thickening of the right brachial plexus roots and trunks, extending from the intervertebral foramina through the interscalene triangle. Fascicular architecture is preserved without nodularity or mass, consistent with Right Brachial Plexitis.": 0.9976434111595154,
  "right brachial plexitis|||A coronal STIR sequence reveals prominent right-sided plexus edema with poorly defined margins at the level of the supraclavicular and retroclavicular segments. The plexus appears expanded with faint perineural fat stranding, without evidence of focal enhancement or mass lesion.": 0.9976479411125183,
  "right brachial plexitis|||Axial and sagittal images show enlargement and T2 signal hyperintensity in the right C5–C7 nerve roots and trunks, with effacement of the peribrachial fat and no associated soft tissue mass or bony abnormality, consistent with inflammatory plexitis.": 0.9976479411125183,
  "right brachial plexitis|||An MRI image shows linear high signal in the right brachial plexus extending into the costoclavicular and infraclavicular regions. There is no diffusion restriction or post-contrast enhancement, which helps distinguish it from neoplastic or traumatic etiologies.": 0.9976429343223572,
  "right brachial plexitis|||High-resolution imaging reveals fascicular thickening and edema within the right upper brachial plexus extending into the axillary region. The left side remains normal, and there is no lymphadenopathy or compressive lesion, supporting an isolated inflammatory process.": 0.9976561665534973,
  "right brachial plexitis|||Right Brachial Plexitis predominantly involves the C5–C7 roots and upper trunk, extending into the interscalene and supraclavicular segments. No contralateral involvement is observed, reinforcing the diagnosis of a unilateral inflammatory plexopathy.": 0.9977017641067505,
  "right brachial plexitis|||T2-weighted and STIR sequences demonstrate asymmetric thickening and hyperintensity along the right brachial plexus with perineural edema. Absence of enhancement or mass rules out metastasis or radiation plexopathy and supports a benign inflammatory process.": 0.9976512789726257,
  "right brachial plexitis|||The pathology is limited to the nerve elements, with no abnormality in adjacent vasculature, lymph nodes, or osseous structures. The isolated plexus involvement, without enhancement or nodular change, favors non-compressive inflammatory brachial neuritis.": 0.9976820349693298,
  "right brachial plexitis|||Right Brachial Plexitis is classified as a non-compressive peripheral nerve inflammatory disorder, most often idiopathic or post-viral. MRI shows unilateral nerve thickening with T2 hyperintensity and no enhancement or mass.": 0.9976818561553955,
  "right brachial plexitis|||This condition falls under immune-mediated neuropathies. MRI findings—unilateral edema and plexus thickening without structural distortion—distinguish it from neoplastic, post-radiation, or traumatic plexopathies.": 0.997651219367981,
  "sjögrens syndrome|||Axial T2-weighted and post-contrast sequences reveal diffusely enlarged parotid glands bilaterally, containing multiple round, hyperintense cystic foci with central hypointensity. The lobulated gland margins and internal heterogeneity strongly indicate lymphoepithelial sialadenitis consistent with chronic Sjögren’s involvement.": 0.9976506233215332,
  "sjögrens syndrome|||Coronal contrast-enhanced images display discrete enhancement of the facial nerve as it traverses the parotid region, especially along the stylomastoid segment, indicating mild perineural inflammation. No mass-like lesion or nodularity is seen, aligning with autoimmune perineuritis rather than neoplasm.": 0.9976617693901062,
  "sjögrens syndrome|||Multiplanar imaging demonstrates well-preserved brain parenchyma without pathologic T2/FLAIR hyperintensities in white matter or deep structures. No evidence of demyelinating plaques or vasculitic lesions supports the absence of CNS involvement in this patient subset of Sjögren’s Syndrome.": 0.9976575374603271,
  "sjögrens syndrome|||Axial and sagittal images show clearly defined submandibular glands with increased T2 signal and ductal dilatation. The intraglandular pattern is heterogeneous but non-mass forming, consistent with sialadenitis and glandular remodeling secondary to autoimmune exocrinopathy.": 0.9976591467857361,
  "sjögrens syndrome|||High-resolution coronal post-contrast imaging reveals streaky enhancement and fibrosis-like reticulations within the parotid and submandibular glands, suggesting advanced-stage Sjögren’s. These linear signal alterations represent interstitial fibrotic changes from chronic lymphoplasmacytic infiltration.": 0.9976697564125061,
  "sjögrens syndrome|||Disease distribution is confined to the exocrine glands—specifically, the parotid and submandibular glands—showing bilateral, symmetric involvement. No abnormal signal is detected in brain structures or cervical lymph nodes, confirming a glandular-dominant phenotype without neurovascular extension.": 0.9976561665534973,
  "sjögrens syndrome|||Mild perineural enhancement is isolated to the intraparotid segment of the facial nerve, without mass effect or cranial nerve root enhancement intracranially. The pattern supports a benign autoimmune etiology and distinguishes it from sarcoid or neoplastic perineural spread.": 0.9976704120635986,
  "sjögrens syndrome|||No cerebral or spinal cord parenchymal lesions are seen in either T2 or post-contrast images. The absence of multifocal white matter changes or leptomeningeal enhancement reinforces the purely peripheral and glandular nature of this presentation.": 0.9976516962051392,
  "sjögrens syndrome|||This case typifies the exocrine-dominant form of Sjögren’s Syndrome, presenting with chronic sialadenitis and minor perineural involvement but no CNS pathology, differentiating it from neuroinflammatory or demyelinating disorders.": 0.9976932406425476,
  "sjögrens syndrome|||Radiologic findings confirm autoimmune sialadenitis with facial nerve irritation, consistent with a systemic connective tissue disease of autoimmune origin. Imaging excludes alternative diagnoses such as IgG4-RD, sarcoidosis, or salivary neoplasms.": 0.9976955056190491,
  "sural nerve neurofibroma|||An axial MRI slice reveals a sharply marginated, ovoid lesion with a hyperintense T2 signal, centered in the posterior subcutaneous soft tissue near the sural nerve.": 0.9976388216018677,
  "sural nerve neurofibroma|||A sagittal view highlights a well-encapsulated fusiform lesion with mild heterogeneity and bright T2 signal, tracking along the anatomical course of the sural nerve.": 0.9976615309715271,
  "sural nerve neurofibroma|||Coronal and sagittal MRI slices show a solitary mass exhibiting the classic 'target sign' with central hypointensity and peripheral hyperintensity on T2-weighted imaging.": 0.9976698756217957,
  "sural nerve neurofibroma|||Multiple images show an elongated, non-infiltrative soft tissue mass with intermediate T1 and bright T2 signal intensity, closely aligned with a superficial sensory nerve pathway.": 0.997661828994751,
  "sural nerve neurofibroma|||The lesion appears as a well-demarcated structure with a fascicular internal architecture, matching the nerve fiber bundle pattern, localized to the posterior distal calf.": 0.9976877570152283,
  "sural nerve neurofibroma|||The lesion is confined to the superficial posterior compartment of the distal leg, adjacent to the Achilles tendon and fibula, and follows the expected anatomical route of the sural nerve.": 0.9977083206176758,
  "sural nerve neurofibroma|||The tumor is unilateral and solitary in distribution, with no evidence of multifocality, bilateral symmetry, or nerve root involvement.": 0.9976808428764343,
  "sural nerve neurofibroma|||Consistent with its sensory origin, the lesion is localized to the extramuscular course of the sural nerve, with no associated muscle edema or CNS involvement.": 0.997689962387085,
  "sural nerve neurofibroma|||Sural nerve neurofibroma is a benign peripheral nerve sheath tumor presenting as a solitary, superficial, non-invasive lesion.": 0.9977383017539978,
  "sural nerve neurofibroma|||This entity belongs to the category of neurogenic soft tissue tumors. Imaging supports a diagnosis of localized (non-plexiform) neurofibroma.": 0.9977037310600281,
  "thoracic outlet syndrome|||An MRI image showing crowding and anterior displacement of the lower brachial plexus at the costoclavicular space, with associated signal hyperintensity and loss of normal perineural fat planes, consistent with neurogenic Thoracic Outlet Syndrome.": 0.9976716637611389,
  "thoracic outlet syndrome|||An MRI image showing narrowed interscalene triangle with thickening and T2 hyperintensity of the C8–T1 nerve roots as they pass between the anterior and middle scalene muscles, with no evidence of mass or cystic lesion, supporting a compressive etiology.": 0.9976727366447449,
  "thoracic outlet syndrome|||An MRI image demonstrating extrinsic compression of the subclavian vein with partial effacement of its lumen in the costoclavicular interval, without thrombus, consistent with venous Thoracic Outlet Syndrome in the absence of dynamic positional imaging.": 0.9976975321769714,
  "thoracic outlet syndrome|||An MRI image revealing an elongated C7 transverse process and fibrous band-like low-signal structure extending toward the first rib, indenting adjacent neural elements, confirming a congenital anatomical contributor to Thoracic Outlet Syndrome.": 0.9976680278778076,
  "thoracic outlet syndrome|||An MRI image showing asymmetric fatty atrophy and volume loss of paraspinal muscles on the affected side, suggestive of chronic neural compromise, with no signal abnormality within the spinal cord itself, in keeping with peripheral nerve entrapment.": 0.9976460933685303,
  "thoracic outlet syndrome|||The compression in Thoracic Outlet Syndrome primarily involves the lower brachial plexus roots (C8–T1), especially as they traverse the interscalene triangle and costoclavicular space. This region often demonstrates hyperintensity, thickening, and distortion in T2-weighted sequences.": 0.9976983666419983,
  "thoracic outlet syndrome|||The subclavian vessels and brachial plexus trunks appear variably impinged between the anterior scalene muscle and first rib. Unilateral involvement is common, with affected neural elements displaced anteriorly or superiorly, sometimes accompanied by soft tissue edema.": 0.9976927638053894,
  "thoracic outlet syndrome|||MRI confirms that the pathology is localized to the extraforaminal brachial plexus and subclavian vessels. The cervical spine and spinal cord are preserved, helping exclude central causes like myelopathy, radiculopathy, or demyelinating disease.": 0.997657299041748,
  "thoracic outlet syndrome|||Thoracic Outlet Syndrome is classified as a peripheral entrapment syndrome, affecting neural and/or vascular elements without central nervous system involvement. MRI helps differentiate it from spinal, neoplastic, and demyelinating pathologies.": 0.9977014064788818,
  "thoracic outlet syndrome|||This syndrome falls under compressive neuropathies and vascular impingement syndromes, with neurogenic, venous, and arterial subtypes. MRI is essential to confirm structural impingement and exclude mimics such as Pancoast tumors or discogenic radiculopathy.": 0.9976717233657837,
  "tuberous sclerosis|||An axial T2-weighted image reveals multiple cortical and subcortical tubers with high signal intensity and distorted gyral contour, predominantly in the frontal and parietal lobes. These lesions appear well-defined with cortical thickening, representing classic features of Tuberous Sclerosis Complex (TSC).": 0.9976387023925781,
  "tuberous sclerosis|||Several radial migration lines extending from the periventricular white matter to the cortical surface are observed bilaterally, most prominent in the frontal lobes. These T2/FLAIR hyperintense bands support disrupted neuronal migration—hallmark of TSC.": 0.9976693391799927,
  "tuberous sclerosis|||Subependymal nodules are visible along the lateral ventricular walls, seen as isointense or mildly hyperintense on T2-weighted images. No contrast-enhancing masses are detected, excluding active or growing SEGA at the time of imaging.": 0.99765944480896,
  "tuberous sclerosis|||A rounded lesion adjacent to the left frontal horn demonstrates intermediate T1 and hyperintense T2 signal without restricted diffusion or enhancement, representing a non-enhancing, stable subependymal nodule typical of TSC.": 0.9976319074630737,
  "tuberous sclerosis|||Diffuse white matter signal abnormalities are appreciated in the periventricular and deep subcortical zones, especially around the frontal horns, reflecting areas of dysmyelination or gliosis associated with chronic TSC progression.": 0.9976450800895691,
  "tuberous sclerosis|||Cortical and subcortical tubers are distributed throughout the bilateral frontal and parietal lobes with asymmetrical prominence on the left. Lesions distort normal gyral architecture and are accompanied by white matter changes suggestive of widespread cortical dysplasia.": 0.9976540803909302,
  "tuberous sclerosis|||Subependymal nodules cluster along the lateral ventricles, particularly the caudothalamic groove and frontal horns. These nodules are bilateral and non-obstructive, differentiating them from mass-forming lesions such as SEGAs.": 0.9976658821105957,
  "tuberous sclerosis|||Radial migration lines are clearly delineated in both coronal and axial planes, extending from periventricular regions toward the cortical surface, predominantly in the superior frontal gyri—confirming the migrational anomaly inherent in Tuberous Sclerosis.": 0.9976921677589417,
  "tuberous sclerosis|||Tuberous Sclerosis is a neurocutaneous disorder (phakomatosis) with hallmark imaging findings of cortical tubers, subependymal nodules, and radial migration lines. MRI enables differentiation from neoplasms and leukodystrophies by their stereotyped appearance and non-aggressive nature.": 0.9976435303688049,
  "tuberous sclerosis|||This case illustrates a genetically driven neurodevelopmental disorder characterized by aberrant cell proliferation and migration. Absence of contrast enhancement and mass effect helps distinguish TSC from gliomas or other enhancing pathologies in the pediatric and young adult population.": 0.9976662993431091,
  "two-week follow-up with spectroscopy|||An axial FLAIR MRI showing bilateral periventricular and deep white matter hyperintensities with no mass effect, consistent with subacute demyelination.": 0.9976511001586914,
  "two-week follow-up with spectroscopy|||A sagittal T2-weighted cervical spine MRI revealing a faint central cord hyperintensity at C2–C4 without cord swelling, suggestive of post-inflammatory gliosis.": 0.9976524710655212,
  "two-week follow-up with spectroscopy|||A T1-weighted brain MRI demonstrating preserved cortical architecture and gray-white differentiation with no parenchymal enhancement, excluding acute edema.": 0.9976487159729004,
  "two-week follow-up with spectroscopy|||An axial T2 image at the level of the basal ganglia showing symmetric anatomy and absence of signal abnormality, ruling out gray matter involvement.": 0.9976591467857361,
  "two-week follow-up with spectroscopy|||Axial sections at the level of the brainstem displaying intact pons and medulla with no signal changes, indicating disease confined to supratentorial white matter.": 0.9976485967636108,
  "two-week follow-up with spectroscopy|||MRI showing bilateral deep white matter lesions with posterior predominance and sparing of subcortical U-fibers and cortex, consistent with a resolving demyelinating process.": 0.9976434111595154,
  "two-week follow-up with spectroscopy|||Cervical spine MRI revealing localized central T2 hyperintensity without expansile changes or contrast uptake, supporting subacute recovery from myelitis.": 0.9976658821105957,
  "two-week follow-up with spectroscopy|||Supratentorial MRI slices indicating symmetric, non-enhancing lesions and absence of cortical, callosal, or meningeal involvement, excluding neoplastic or infectious etiologies.": 0.9976428747177124,
  "two-week follow-up with spectroscopy|||Findings compatible with immune-mediated demyelinating disease such as ADEM, based on bilateral deep white matter lesions and non-enhancing cervical cord signal changes.": 0.9976816177368164,
  "two-week follow-up with spectroscopy|||A stable post-inflammatory CNS pattern characterized by periventricular lesion persistence, no diffusion restriction, and preservation of structural brain integrity.": 0.997688889503479,
  "typical adrenoleukodystrophy|||An MRI image showing confluent bilateral T2 hyperintensities involving the posterior periventricular white matter and extending into the splenium of the corpus callosum. The lesions show a sharp anterior demarcation, consistent with active demyelination in Typical Adrenoleukodystrophy.": 0.9976531863212585,
  "typical adrenoleukodystrophy|||Coronal and sagittal views confirm posterior-predominant demyelination, with sparing of frontal lobes and subcortical U-fibers. The lesion margins are irregular but non-enhancing, consistent with a subacute, non-inflammatory phase of disease.": 0.9976295232772827,
  "typical adrenoleukodystrophy|||Axial T1-weighted sequences reveal hypointense signal in the parieto-occipital white matter, corresponding to T2 hyperintensities, indicating severe myelin loss. Volume loss in these areas suggests chronic disease evolution.": 0.9976359605789185,
  "typical adrenoleukodystrophy|||There is mild to moderate posterior cerebral atrophy, with ventricular ex vacuo dilatation noted in the occipital horns and peritrigonal regions. These findings reflect longstanding demyelination in the posterior cerebrum.": 0.9976415038108826,
  "typical adrenoleukodystrophy|||Lesions in the splenium of the corpus callosum exhibit clear involvement without contrast enhancement. This posterior callosal signal change is highly characteristic of the childhood cerebral form of Adrenoleukodystrophy.": 0.9976657629013062,
  "typical adrenoleukodystrophy|||Lesions are symmetrically distributed within the parieto-occipital white matter, extending medially through the splenium of the corpus callosum. Frontal white matter and subcortical U-fibers remain unaffected, consistent with Typical Adrenoleukodystrophy.": 0.9976696968078613,
  "typical adrenoleukodystrophy|||No involvement of basal ganglia, thalami, or brainstem is evident. The absence of contrast enhancement or peripheral edema distinguishes this imaging pattern from more aggressive or inflammatory white matter diseases.": 0.997644305229187,
  "typical adrenoleukodystrophy|||Atrophy is localized posteriorly, with secondary ventricular enlargement. The topographic pattern—posterior dominant, symmetric, sparing frontal lobes—helps exclude leukodystrophies with frontal or diffuse patterns like Krabbe or metachromatic leukodystrophy.": 0.997658908367157,
  "typical adrenoleukodystrophy|||Typical Adrenoleukodystrophy is a peroxisomal X-linked demyelinating disorder categorized under leukodystrophies. MRI reveals a characteristic posterior-predominant, symmetric white matter disease, aiding distinction from neoplastic, infectious, or autoimmune conditions.": 0.9976730346679688,
  "typical adrenoleukodystrophy|||This case represents a non-enhancing, subacute stage of cerebral ALD. The absence of ring enhancement and restricted diffusion supports chronic progression rather than active inflammation or acute necrotizing processes.": 0.9976966977119446,
  "walker-warburg syndrome|||An MRI image showing cobblestone lissencephaly characterized by a thick, irregular cortex with shallow sulci and indistinct gray–white matter boundaries, most notable in the frontoparietal regions, consistent with Walker-Warburg Syndrome.": 0.9976764917373657,
  "walker-warburg syndrome|||Axial T2-weighted image reveals pronounced ventriculomegaly with irregular ventricular margins and thinned surrounding parenchyma. Absence of the septum pellucidum and callosal dysgenesis are clearly visible, characteristic of WWS.": 0.9976652264595032,
  "walker-warburg syndrome|||Posterior fossa structures show severe cerebellar hypoplasia with markedly underdeveloped hemispheres and vermis. The brainstem appears small and poorly formed, confirming hindbrain maldevelopment seen in Walker-Warburg Syndrome.": 0.9976861476898193,
  "walker-warburg syndrome|||White matter signal abnormalities are evident in the periventricular and deep regions bilaterally, with delayed myelination and diffuse T2 hyperintensity, reflecting neurodevelopmental arrest in WWS.": 0.997681200504303,
  "walker-warburg syndrome|||A mid-sagittal image demonstrates agenesis of the corpus callosum and elevation of the third ventricle. The cerebral aqueduct is patent, and no obstructive hydrocephalus is seen, supporting a diagnosis of hydrocephalus ex vacuo due to cortical underdevelopment.": 0.9976564049720764,
  "walker-warburg syndrome|||WWS demonstrates bilateral and symmetric cobblestone cortical malformation throughout the cerebral hemispheres, most severe in the frontoparietal lobes. Cortical thickening and sulcal effacement confirm widespread neuronal migration failure.": 0.9976802468299866,
  "walker-warburg syndrome|||Cerebellar and brainstem hypoplasia are consistent and severe, affecting the vermis and pons. These malformations are defining features and differentiate WWS from other cortical migration disorders such as Miller-Dieker syndrome.": 0.9976790547370911,
  "walker-warburg syndrome|||Absent corpus callosum, absent septum pellucidum, and expanded lateral ventricles with thinned cortical mantle are consistently observed. These midline and ventricular abnormalities reinforce the syndromic nature of WWS.": 0.9976913928985596,
  "walker-warburg syndrome|||Walker-Warburg Syndrome is a congenital muscular dystrophy and severe neuronal migration disorder. MRI features of cobblestone lissencephaly, posterior fossa hypoplasia, and hydrocephalus support a diagnosis of dystroglycanopathy.": 0.9977248311042786,
  "walker-warburg syndrome|||WWS belongs to the spectrum of congenital brain malformations with systemic involvement. Imaging reveals multilobar cortical dysplasia, brainstem-cerebellar anomalies, and ventricular enlargement, distinguishing it from isolated lissencephalies or hydrocephalus.": 0.9976792335510254
}